# Схожие слова

Напишите программу, которая находит все схожие слова для заданного слова. Слова называются схожими, если имеют
одинаковое количество и расположение гласных букв. При этом сами гласные могут различаться.

**Формат входных данных**

На вход программе подается одно слово, записанное в первой строке, затем натуральное число n — количество слов для
сравнения и nn строк со словами.

**Формат выходных данных**

Программа должна вывести все схожие слова для заданного слова, сохранив их исходный порядок следования.

**Примечание 1.** После последней гласной в начальном и проверяемом слове может быть любое количество согласных.

**Примечание 2.** В русском языке 10 гласных букв (а, у, о, ы, и, э, я, ю, ё, е) и 21 согласная буква (б, в, г, д, ж, з,
й, к, л, м, н, п, р, с, т, ф, х, ц, ч, ш, щ).

**Примечание 3.** Тестовые данные доступны по ссылке.

**Sample Input 1:**

```python
машина
8
сеть
машинист
дорога
урок
работа
аксиома
железо
ветеран
```

**Sample Output 1:**

```python
машинист
дорога
работа
железо
ветеран
```

**Sample Input 2:**

```python
весть
3
месть
гость
лань
```

**Sample Output 2:**

```python
месть
гость
лань
```

# Solution

```python
glasn = 'ауоыиэяюёе'
st = input()
n = int(input())
arr = [input() for i in range(n)]
st = ''.join('г' if i in glasn else 'с' for i in st)
for k, v in enumerate(arr):
    arr[k] = (v, ''.join('г' if i in glasn else 'с' for i in v))
arr = [i[0] for i in filter(lambda x: (x[1].startswith(st) or st.startswith(x[1]))  and st.count('г') == x[1].count('г'), arr)]
print(*arr, sep='\n')
```