# Файлы в файле 🌶️🌶️

Вам доступен текстовый файл files.txt, содержащий информацию о файлах. Каждая строка файла содержит три значения,
разделенные символом пробела — имя файла, его размер (целое число) и единицы измерения:

```python
cant - help - myself.mp3
7
MB
keep - yourself - alive.mp3
6
MB
bones.mp3
5
MB
...
```

Напишите программу, которая группирует данные файлы по расширению, определяя общий объем файлов каждой группы, и выводит
полученные группы файлов, указывая для каждой ее общий объем. Группы должны быть расположены в лексикографическом
порядке названий расширений, файлы в группах — в лексикографическом порядке их имен.

**Примечание 1**. Например, если бы файл files.txt имел вид:

```python
input.txt
3000
B
scratch.zip
300
MB
output.txt
1
KB
temp.txt
4
KB
boy.bmp
2000
KB
mario.bmp
1
MB
data.zip
900
MB
```

то программа должна была бы вывести:

```python
boy.bmp
mario.bmp
----------
Summary: 3
MB

input.txt
output.txt
temp.txt
----------
Summary: 8
KB

data.zip
scratch.zip
----------
Summary: 1
GB
```

где Summary — общий объем файлов группы.

**Примечание 2.** Гарантируется, что все имена файлов содержат расширение.

**Примечание 3.** Общий объем файлов группы записывается в самых крупных (максимально возможных) единицах измерения с
округлением до целых. Другими словами, сначала следует определить суммарный объем всех файлов группы, скажем, в байтах,
а затем перевести полученное значение в самые крупные (максимально возможные) единицы измерения. Примеры перевода:

* 1023 B -> 1023 B
* 1300 B -> 1 KB
* 1900 B -> 2 KB

**Примечание 4**. Значения единиц измерения такие же, какие приняты в информатике:

* 1 KB = 1024 B
* 1 MB = 1024 KB
* 1 GB = 1024 MB

**Примечание 5**. Указанный файл доступен по ссылке. Ответ на задачу доступен по ссылке.

**Примечание 6**. При открытии файла используйте явное указание кодировки UTF-8.

# Solution

```python
import math


def convert_size(size_bytes):
    if size_bytes == 0:
        return "0B"
    size_name = ("B", "KB", "MB", "GB", "TB", "PB", "EB", "ZB", "YB")
    i = int(math.floor(math.log(size_bytes, 1024)))
    p = math.pow(1024, i)
    s = int(round(size_bytes / p, 0))
    return "%s %s" % (s, size_name[i])


convert = {'B': 1, 'KB': 1024, 'MB': 1024 ** 2, 'GB': 1024 ** 3}
dic = {}
with open(r'files.txt', 'r', encoding='UTF-8') as f:
    for line in f.readlines():
        i = line.split()
        ext = i[0][-i[0][::-1].find('.'):]
        dic.setdefault(ext, [[], 0])
        dic[ext][0].append(i[0])
        dic[ext][1] += int(i[1]) * convert[i[2]]

for k, i in sorted(dic.items()):
    print(*sorted(i[0]), sep='\n')
    print('----------')
    print(f'Summary: {convert_size(i[1])}')
    print()
```