# Необычная сортировка 🌶️

Дана строка, содержащая латинские буквы и цифры. Напишите программу, которая сортирует символы в строке согласно
следующим правилам:

* все отсортированные строчные буквы стоят перед заглавными буквами
* все отсортированные заглавные буквы стоят перед цифрами
* все отсортированные нечетные цифры стоят перед четными

**Формат входных данных**

На вход программе подается строка, содержащая латинские буквы и цифры.

**Формат выходных данных**

Программа должна расположить символы в строке в соответствии с условием задачи и вывести полученный результат.

**Sample Input 1:**

```python
Sorting1234
```

**Sample Output 1:**

```python
ginortS1324
```

**Sample Input 2:**

```python
n0tEast3rEgg
```

**Sample Output 2:**

```python
aggnrsttEE30
```

**Sample Input 3:**

```python
3DYrz34UXl
```

**Sample Output 3:**

```python
lrzDUXY334
```

# Solution

```python

string = list(input())
num_list = sorted([i for i in sorted(string) if i.isdigit()], key =lambda x: int(x) % 2 == 0)
chars = sorted([i for i in sorted(string) if i.isalpha()], key=lambda x: -x.islower())

print(''.join(chars + num_list))
```