# Минимум и максимум

Напишите программу, которая определяет минимальное и максимальное значения функции на отрезке в целых точках.

**Формат входных данных**
На вход программе в первой строке подается корректная функция f(x)f(x), в следующей строке вводятся два целых числа aa и
bb, разделенные пробелом, которые представляют границы отрезка [a; b][a;b].

**Формат выходных данных**
Программа должна определить минимальное и максимальное значения функции f(x)f(x) на отрезке [a; b][a;b] в целых точках и
вывести полученный результат в следующем формате:

Минимальное значение функции <функция f(x)> на отрезке <отрезок> равно <мин. значение>
Максимальное значение функции <функция f(x)> на отрезке <отрезок> равно <макс. значение>
**Примечание 1.** Под корректной функцией подразумевается выражение, полностью соответствующее синтаксису языка Python.

**Примечание 2.** Тестовые данные доступны по ссылке.

**Sample Input 1:**

```python
2 * x ** 2 + 5 * x + 7
-1
5
```

**Sample Output 1:**

```python
Минимальное
значение
функции
2 * x ** 2 + 5 * x + 7
на
отрезке[-1;
5] равно
4
Максимальное
значение
функции
2 * x ** 2 + 5 * x + 7
на
отрезке[-1;
5] равно
82
```

**Sample Input 2:**

```python
x + 1
-999
999
```

**Sample Output 2:**

```python
Минимальное
значение
функции
x + 1
на
отрезке[-999;
999] равно - 998
Максимальное
значение
функции
x + 1
на
отрезке[-999;
999] равно
1000
```

# Solution

```python
func, res = input(), []
x1, x2 = map(int, input().split())
for x in range(x1, x2 + 1):
    res.append(eval(func))

print(f'''Минимальное значение функции {func} на отрезке [{x1}; {x2}] равно {min(res)}
Максимальное значение функции {func} на отрезке [{x1}; {x2}] равно {max(res)}''')
```