# Новый print()
Напишите программу, которая переопределяет встроенную функцию print() так, чтобы она печатала все переданные строковые аргументы в верхнем регистре.

**Примечание 1.** Значения sep и end также должны переводиться в верхний регистр.

**Примечание 2.** В тестирующую систему сдайте программу, содержащую только переопределенную функцию print(), но не код, вызывающий ее.

Задача представлена исключительно в учебных целях, на практике применять подобное, конечно, не следует.

**Sample Input 1:**
```python
print('beegeek', [1, 2, 3], 4)
```
**Sample Output 1:**
```python
BEEGEEK [1, 2, 3] 4
```
**Sample Input 2:**
```python
print('bee', 'geek', sep=' and ', end=' wow')
```
**Sample Output 2:**
```python
BEE AND GEEK WOW
```
**Sample Input 3:**
```python
words = ('black', 'white', 'grey', 'black-1', 'white-1', 'python')
print(*words, sep=' to ', end=' LOVE')
```
**Sample Output 3:**
```python
BLACK TO WHITE TO GREY TO BLACK-1 TO WHITE-1 TO PYTHON LOVE
```

# Solution
```python
def wrong_print(*args, sep=' ', end='\n'):
    arr = [i.upper() if type(i) == str else i for i in args]
    wrong_print(*arr, sep=sep.upper(), end=end.upper())
    
print, wrong_print = wrong_print, print
```