# Новый print
Напишите программу с использованием декоратора, которая переопределяет функцию print() так, чтобы она печатала весь текст в верхнем регистре.

**Формат входных данных**
На вход программе ничего не подается.

**Формат выходных данных**
Программа должна задекорировать функцию print() так, чтобы она печатала весь текст в верхнем регистре.

**Примечание 1**. Значения sep и end также должны переводиться в верхний регистр.

**Примечание 2.** Не забывайте про то, что декоратор не должен поглощать возвращаемое значение декорируемой функции, а также должен уметь декорировать функции с произвольным количеством позиционных и именованных аргументов.

**Sample Input 1:**
```python
print('hi', 'there', end='!')
```
**Sample Output 1:**
```python
HI THERE!
```
**Sample Input 2:**
```python
print('are you in trouble?')
```
**Sample Output 2:**
```python
ARE YOU IN TROUBLE?
```
**Sample Input 3:**
```python
print(111, 222, 333, sep='xxx')
```
**Sample Output 3:**
```python
111XXX222XXX333
```

# Solution
```python
def print_upper(func):
    def wrapper(*args, **kwargs):
        args = (str(arg).upper() for arg in args)
        kwargs = {k: str(v).upper() for k, v in kwargs.items()}
        return func(*args, **kwargs)
    return wrapper

print = print_upper(print)
```