# 3.1.7 Игра на выбывание
На вход программе подается натуральное число n.

В последовательности чисел от 1 до n, начиная слева направо, удалите первое число, а затем все остальные числа через одно, пока не дойдете до конца списка. Повторите этот процесс еще раз, но на этот раз справа налево, удалите крайнее правое число и все остальные числа через одно из оставшихся чисел. Продолжайте этот процесс, чередуя слева направо и справа налево, пока не останется одно число.

Напишите программу, которая выводит последнее оставшееся число.

**Формат входных данных**

На вход программе подается одно натуральное число n.

**Формат выходных данных**

Программа должна вывести целое число, в соответствии с условием задачи.

**Примечание. Пояснение для первого теста:**

1 2 3 4 5 6 7 8 9 –> **1** 2 **3** 4 **5** 6 **7** 8 **9** –> 2 4 6 8 –> 2 **4** 6 **8** –> 2 6 –> **2** 6 –> 6

**Sample Input 1:**
```
9
```
**Sample Output 1:**
```
6
```
**Sample Input 2:**
```
15
```
**Sample Output 2:**
```
8
```
# Solution
```python
n = int(input())
arr = list(range(1, n + 1))


def left(arr):
    del arr[::2]
    return arr


def right(arr):
    del arr[::-2]
    return arr


count = 0
while len(arr) != 1:
    if count % 2 == 0:
        arr = left(arr)
        # print(arr)
    else:
        arr = right(arr)
        # print(arr)
    count += 1
print(*arr)
```
