# 3.1.4 Счастливое число 
Назовем число счастливым если это число превращается в 11 после нескольких итераций вида:

_число заменяется на число, равное сумме квадратов его цифр;_

Напишите программу, которая определяет является ли введенное число счастливым или нет.

**Формат входных данных**

На вход программе подается натуральное число nn.

**Формат выходных данных**

Программа должна вывести YES если число – счастливое и NO в противном случае.

Примечание. Не каждое число после нескольких итераций такого вида превратится в 11, так как для некоторых чисел соответствующий цикл будет бесконечным.

**Sample Input 1:**
```
1122
```
**Sample Output 1:**
```
YES
```
**Sample Input 2:**
```
11
```
**Sample Output 2:**
```
NO
```
**Sample Input 3:**
```
2568
```
**Sample Output 3:**
```
YES
```
# Solution
```python
n = input()


def result(n):
    if len(n) == 0:
        return n == n * n
    else:
        x = [int(i) * int(i) for i in n]
        return str(sum(x))


while len(n) > 1:
    n = result(n)
if n == '1':
    print("YES")
else:
    print("NO")
```
