# 4.1.1 Счастливое число 2
На вход подается строка, состоящая из целых чисел, разделенных пробелами. Назовем число счастливым если его частота появления в строке равна его значению.

Напишите программу, которая выводит самое большое счастливое число в заданной строке.

**Формат входных данных**
На вход программе подается строка, которая состоит из целых чисел.

**Формат выходных данных**
Программа должна вывести самое большое счастливое число. Если счастливых чисел нет, вывести −1.

**Sample Input 1:**
```
2 9 10 432 432 0 1 2
```
**Sample Output 1:**
```
2
```
**Sample Input 2:**
```
5 3 3 3 2 2
```
**Sample Output 2:**
```
3
```
**Sample Input 3:**
```
2 2 2 3 3
```
**Sample Output 3:**
```
-1
```
**Sample Input 4:**
```
10
```
**Sample Output 4:**
```
-1
```
# Solution
```python
nums = input().split()
res = []
for i in nums:
    if nums.count(i) == int(i):
        res.append(i)
res = list(map(int, res))
if len(res) > 0:
    print(max(res))
else:
    print('-1')
```
