# Обратный порядок

Дана последовательность целых чисел. Напишите программу с использованием рекурсии, которая выводит эту
последовательность в обратном порядке.

**Формат входных данных**
На вход программе подается последовательность целых чисел, каждое на отдельной строке. Концом последовательности
является число 00.

**Формат выходных данных**
Программа должна вывести введенные числа в обратном порядке, каждое на отдельной строке.

**Примечание.** Тестовые данные доступны по ссылке.

**Sample Input 1:**

```python
1
2
3
4
0
```

**Sample Output 1:**

```python
0
4
3
2
1
```

**Sample Input 2:**

```python
0
```

**Sample Output 2:**

```python
0
```

# Solution

```python
def rec(i):
    if i != '0':
        rec(input())
    print(i)
rec(input())
```