# Песочные часы

Напишите программу с использованием рекурсивной функции, которая выводит изображение песочных часов, составленное из
цифр 11, 22, 33, и 44:

```python
1111111111111111    # 16 раз
  222222222222      # 12 раз
    33333333        # 8 раз
      4444          # 4 раза
    33333333        # 8 раз
  222222222222      # 12 раз
1111111111111111    # 16 раз
```

**Формат входных данных**

На вход программе ничего не подается.

**Формат выходных данных**

Программа должна вывести изображение песочных часов, составленное из цифр 11, 22, 33, и 44, представленное в условии
задачи.

**Примечание.** Количество цифр в каждой строке, указанное в комментариях, выводить не нужно.

# Solution

```python
def rec(start=4, end=1):
    print((str(end) * start * 4).center(16))
    if start > 1:
        rec(start - 1, end + 1)
        print((str(end) * start * 4).center(16))
rec()
```