# Сумма цифр

Напишите программу с использованием рекурсии, которая принимает на вход число и выводит сумму цифр этого числа.

**Формат входных данных**

На вход программе подается неотрицательное целое число.

**Формат выходных данных**

Программа должна определить сумму цифр введенного числа и вывести полученный результат.

**Sample Input 1:**

```python
25
```

**Sample Output 1:**

```python
7
```

**Sample Input 2:**

```python
10000
```

**Sample Output 2:**

```python
1
```

**Sample Input 3:**

```python
12345
```

**Sample Output 3:**

```python
15
```

# Solution

```python
def sum_number(n, summ=0):
    if n == 0:
        print(summ)
    else:
        return sum_number(n // 10, summ + n % 10)
sum_number(int(input()))
```