# Без циклов

Выберем натуральное число n = 16n=16 и будем вычитать из него число 55, пока оно не перестанет быть положительным:

```python
16 - 5 = 11
11 - 5 = 6
6 - 5 = 1
1 - 5 = -4
```

Исходное число n после четырех вычитаний перестало быть положительным и стало равным −4. Теперь будем прибавлять к нему
число 5, пока оно снова не станет равным n:

```python
-4 + 5 = 1
1 + 5 = 6
6 + 5 = 11
11 + 5 = 16
```

Напишите программу с использованием рекурсии, которая принимает на вход число n и вычитает из него число 5, пока оно не
перестанет быть положительным, а затем прибавляет к нему число 5, пока оно снова не станет равным n.

**Формат входных данных**
На вход программе подается натуральное число.

**Формат выходных данных**
Программа должна выполнить алгоритм, представленный в условии задачи, и вывести все результаты арифметических операций,
произведенных с введенным числом, каждый на отдельной строке.

**Примечание 1.** Обратите внимание, что в начале и в конце выводится исходное число nn.

**Примечание 2.** Тестовые данные доступны по ссылке.

**Sample Input 1:**

```python
16
```

**Sample Output 1:**

```python
16
11
6
1
-4
1
6
11
16
```

**Sample Input 2:**

```python
10
```

**Sample Output 2:**

```python
10
5
0
5
10
```

**Sample Input 3:**

```python
1
```

**Sample Output 3:**

```python
1
-4
1
```

# Solution

```python
def rec(start):
    print(start)
    if start > 0:
        rec(start - 5)
        print(start)
        
rec(int(input()))
```