# Количество цифр

Напишите программу с использованием рекурсии, которая принимает на вход число и выводит количество цифр в этом числе.

**Формат входных данных**

На вход программе подается неотрицательное целое число.

**Формат выходных данных**

Программа должна определить количество цифр в введенном числе и вывести полученный результат.

**Sample Input 1:**

```python
50
```

**Sample Output 1:**

```python
2
```

**Sample Input 2:**

```python
17488
```

**Sample Output 2:**

```python
5
```

**Sample Input 3:**

```python
7
```

**Sample Output 3:**

```python
1
```

# Solution

```python
def len_number(n, cnt=0):
    if n == 0:
        print(cnt)
    else:
        return len_number(n // 10, cnt + 1)
len_number(int(input()))
```