# 7.8 Вложенные циклы. Часть 1

# Звездный треугольник 🌶️🌶️

Дано нечетное натуральное число n. Напишите программу, которая печатает равнобедренный звездный треугольник с
основанием, равным n в соответствии с примером:

```
*
**
***
****
***
**
*
```

**Формат входных данных**

На вход программе подается одно нечетное натуральное число.

**Формат выходных данных**

Программа должна вывести треугольник в соответствии с условием.

Примечание. Используйте вложенный цикл for.

**Sample Input 1:**

```
3
```

**Sample Output 1:**

```
*
**
*
```

Sample Input 2:

```
5
```

**Sample Output 2:**

```
*
**
***
**
*
```

# Solution

```python
n = int(input())
for i in range(1, n + 1):
    if i <= n // 2 + 1:
        print("*" * i)
    else:
        print("*" * (n + 1 - i))
```