# 7.9 Вложенные циклы. Часть 2

# Простые числа

На вход программе подается два натуральных числа a и b (a< b). Напишите программу, которая находит все простые числа от
a до b включительно.

**Формат входных данных**

На вход программе подаются два числа, каждое на отдельной строке.

**Формат выходных данных**

Программа должна вывести все простые числа от a до b включительно, каждое на отдельной строке.

Примечание. Число 1 простым не является.

**Sample Input 1:**

```
2
15
```

**Sample Output 1:**

```
2
3
5
7
11
13
```

**Sample Input 2:**

```
1
5
```

**Sample Output 2:**

```
2
3
5
```

# Solution

```python
a, b = int(input()), int(input())


def is_prime(n):
    d = 2
    while n % d != 0:
        if n == 1: 
            break
        d += 1
    return d == n


i = 2
while a != b + 1:
    if is_prime(a):
        print(a)
    a += 1
```