# 2.1.5 Milka 

На вход программе подаются натуральные числа n, m и k. Напишите программу, которая будет определять, можно ли от шоколадки размером n×m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

**Формат входных данных**

На вход программе подается три натуральных числа:  n, m и k, каждое на отдельной строке.

**Формат выходных данных**

Программа должна вывести слово YES, если возможно отломить указанное число долек, в противном случае вывести слово NO.



**Sample Input 1:**
```
5
7
1
```
**Sample Output 1:**
```
NO
```
**Sample Input 2:**
```
7
4
21
```
**Sample Output 2:**
```
YES
```
**Sample Input 3:**
```
6
6
6
```
**Sample Output 3:**
```
YES
```
# Решение/Solution

```
n, m, k = [int(input()) for i in range(3)]
res = []
for i in range(1, n + 1):
    res.append(n * m - i * n)

for i in range(1, m + 1):
    res.append(n * m - i * m)
print(["NO", "YES"][k in res])
```
