#2.1.7 Интересная последовательность
Рассмотрим последовательность чисел в которой каждое натуральное число k встречается ровно k раз:
```
1, 2, 2, 3, 3, 3, 4, 4, 4, 4, ...
```
Напишите программу, которая по данному натуральному числу k выведет первые k членов этой последовательности.

**Формат входных данных**

На вход программе подается натурально число k.

**Формат выходных данных**

Программа должна вывести первые k членов последовательности.

**Sample Input 1:**
```
3
```
**Sample Output 1:**
```
1 2 2
```
**Sample Input 2:**
```
5
```
**Sample Output 2:**
```
1 2 2 3 3
```
**Sample Input 3:**
```
15
```
**Sample Output 3:**
```
1 2 2 3 3 3 4 4 4 4 5 5 5 5 5
```
# Решение/Solution

```
n = int(input())
res = []
for i in range(1, n + 1):
    res.extend([i] * i)
print(*res[:n])
```
