# 2.1.4 Тарифный план Windows
Тимур подключен к интернету по следующему тарифному плану: ежемесячная абонентская плата составляет aa рублей, и в эту абонентскую плату включено bb мегабайт трафика. Неизрасходованные мегабайты в конце месяца «сгорают». Если трафик превышает b мегабайт, то каждый мегабайт трафика сверх предоплаченных стоит c рублей.

Известно, что за прошлый месяц Тимур израсходовал d мегабайт трафика. Напишите программу, которая определяет во сколько обошелся ему доступ в интернет в прошлом месяце (считайте в том числе и абонентскую плату)?

Формат входных данных
На вход программе подаются четыре натуральных числа в следующем порядке: a – размер абонентской платы, b – предоставляемый трафик, c – цена каждого мегабайта трафика и d – израсходованные мегабайты. Каждое число подается на отдельной строке.

Формат выходных данных
Программа должна вывести одно число — сумму, которую Тимур должен заплатить за интернет.

**Sample Input 1:**
```
50
15
25
75
```
**Sample Output 1:**
```
1550
```
**Sample Input 2:**
```
10
1
1
1
```
**Sample Output 2:**
```
10
```
**Sample Input 3:**
```
100
10
12
1
```
**Sample Output 3:**
```
100
```
# Решение/Solution

```
abon, mb_tarif, price_over, used = [int(input()) for i in range(4)]
if used > mb_tarif:
    sverh_tarifa = used - mb_tarif
else:
    sverh_tarifa = 0
price_sverh = sverh_tarifa * price_over
result = abon + price_sverh
print(result)
```
