#2.1.2 Хорошая тройка чисел
Назовем тройку чисел хорошей, если среди них есть хотя бы одно четное и хотя бы одно нечетное число.

Напишите программу, которая определяет является ли тройка чисел хорошей или нет.

**Формат входных данных**

На вход программе подается три целых числа, каждое на отдельной строке.

**Формат выходных данных**

Программа должна вывести YES, если тройка чисел является хорошей и NO в противном случае.

**Sample Input 1:**
```
2
2
13
```
**Sample Output 1:**
```
YES
```
**Sample Input 2:**
```
9
7
1
```
**Sample Output 2:**
```
NO
```
**Sample Input 3:**
```
9
15
14
```
**Sample Output 3:**
```
YES
```
**Sample Input 4:**
```
5
5
5
```
**Sample Output 4:**

`NO`

# Решение/Solution

```
nums = [int(input()) for i in range(3)]
res = [i % 2 == 0 for i in nums]
res2 = [i % 2 == 1 for i in nums]
print(["NO", "YES"][all([any(res), any(res2)])])
```
