#2.1.6 Потерянная карточка
Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась.

Напишите программу, которая выводит номер потерянной карточки.

**Формат входных данных**

На вход программе подается число nn и далее n-1 номеров оставшихся карточек, каждое число на отдельной строке.

**Формат выходных данных**

Программа должна вывести одно число – номер потерянной строки.

**Sample Input 1:**
```
4
3
2
4
```
**Sample Output 1:**
```
1
```
**Sample Input 2:**
```
6
1
2
3
4
5
```
**Sample Output 2:**
```
6
```
**Sample Input 3:**
```
3
3
1
```
**Sample Output 3:**
```
2
```
# Решение/Solution

```
n = int(input())
cards = [int(input()) for i in range(n - 1)]
for i in range(1, n + 1):
    if i not in cards:
        print(i)
```
