# 3.1.6 Найди отличие
На вход программе подаются строки a и b. Строка b генерируется случайным перемешиванием строки aa с последующим добавлением символов в произвольных позициях.

Напишите программу, которая вывыводит символы, которые были добавлены к строке b.

**Формат входных данных**

На вход программе подаются две строки a и b, каждая на отдельной строке. 

**Формат выходных данных**

Программа должна вывести те символы (в любом порядке), которые были добавлены в строку b, на одной строке без пробелов.

**Sample Input 1:**
```
whatsapp
appwwhatss
```
**Sample Output 1:**
```
ws
```
**Sample Input 2:**
```
VPN
VPNa
```
**Sample Output 2:**
```
a
```
**Sample Input 3:**
```
bb
bbba
```
**Sample Output 3:**
```
ba
```
# Solution
```python
first = list(input())
second = list(input())
for i in first:
    second.remove(i)
print(*second, sep="")
```
