# 3.1.3 Несчастливое число
Назовем число несчастливым если его простые множители включают только 22, 33 и 55.

Напишите программу, которая определяет, является ли введенное число несчастливым или нет.

**Формат входных данных**

На вход программе подается натуральное число.

**Формат выходных данных**

Программа должна вывести YES, если число является несчастливым и NO, в противном случае.

**Sample Input 1:**
```
6
```
**Sample Output 1:**
```
YES
```
**Sample Input 2:**
```
33
```
**Sample Output 2:**
```
NO
```
**Sample Input 3:**
```
14
```
**Sample Output 3:**
```
NO
```
**Sample Input 4:**
```
40
```
**Sample Output 4:**
```
YES
```
# Решение/Solution

```
def delit(a):
    res = []
    i = 2
    while i * i < a + 1:
        if a % i == 0:
            res.append(i)
        while a % i == 0:
            a //= i
        i += 1
    if a != 1:
        res.append(a)
    return res


res = delit(int(input()))
if set(res) == {2, 3} or set(res) == {2, 5} or set(res) == {2, 3, 5} or set(res) == {3, 5} or set(res) == {2} or set(
        res) == {3} or set(res) == {5}:
    print("YES")
else:
    print("NO")
```
