# 3.1.2 Перемещение нулей
На вход программе подается строка, состоящая из чисел, разделенных одним пробелом. Необходимо переместить все числа 00 в конец, сохраняя относительный порядок ненулевых элементов. 

**Формат входных данных**

На вход программе подается строка, состоящая из целых чисел, разделенных одним пробелом.

**Формат выходных данных**

Программа должна вывести строку в соответствии с условием задачи.

**Sample Input 1:**
```
0 94 0 3 6 4 0
```
**Sample Output 1:**
```
94 3 6 4 0 0 0
```
**Sample Input 2:**
```
0 0 0
```
**Sample Output 2:**
```
0 0 0
```
**Sample Input 3:**
```
0 5
```
**Sample Output 3:**
```
5 0
```
**Sample Input 4:**
```
1 4 0 0 0
```
**Sample Output 4:**
```
1 4 0 0 0
```
# Решение/Solution

```
numbs = input().split()

def zero(a):
    return a == '0'

print(*sorted(numbs, key=zero))
```
