#3.1.5 Подпоследовательность
На вход подаются строки a и b. 

Напишите программу, которая определяет, является ли строка aa подпоследовательностью строки b.

**Формат входных данных**

На вход программе подаются две строки a и b, каждая на отдельной строке. 

**Формат выходных данных**

Программа должна вывести YES, если строка aa является подпоследовательностью строки bb и NO в противном случае.

Примечание. Подпоследовательность строки – это строка , которая формируется из исходной строки путем удаления некоторых (хотя бы одного) символов, не нарушая относительного расположения остальных символов. Например, строка ace является подпоследовательностью строки abcde , а строка aec нет.

**Sample Input 1:**
```
ось
восемь
```
**Sample Output 1:**
```
YES
```
**Sample Input 2:**
```
речь
изречение
```
**Sample Output 2:**
```
NO
```
**Sample Input 3:**
```
abcde
abcde
```
**Sample Output 3:**
```
NO
```
# Решение/Solution

```
first = list(input())
second = list(input())
second2 = list(second)
res = []
for i in second:
    if i not in first:
        second.remove(i)
for i in second:
    if i not in first:
        second.remove(i)
first = ''.join(first)
second = ''.join(second)
print(["NO", "YES"][str(first) in str(second) and list(first) != second2])
```
