# 4.1.5 Обратная строка
На вход программе подается строка. Напишите программу, которая "переворачивает" строку в соответствии с правилами:

* все символы, не являющиеся буквами, остаются на своих местах;
* все буквы меняют свой порядок на обратный.

**Формат входных данных**

На вход программе подается строка.

**Формат выходных данных**

Программа должна вывести перевернутую строку в соответствии с условием задачи.

**Sample Input 1:**
```
xy!=jk
```
**Sample Output 1:**
```
kj!=yx
```
**Sample Input 2:**
```
a+b-c=abc
```
**Sample Output 2:**
```
c+b-a=cba
```
**Sample Input 3:**
```
J.K.Simmons
```
**Sample Output 3:**
```
s.n.ommiSKJ
```
**Sample Input 4:**
```
n.o.semaJJJ
```
**Sample Output 4:**
```
J.J.Jameson
```
**Sample Input 5:**
```
level...
```
**Sample Output 5:**
```
level...
```
# Решение/Solution

```
word = list(input())
word2 = list(word)
list_word = [i for i, d in enumerate(word) if d.isalpha()]
list_word2 = list(list_word[::-1])
for i in range(len(list_word)):
    word[list_word[i]] = word2[list_word2[i]]

print(*word, sep="")
```
