#4.1.6 удалить k цифр
На вход программе подается два числа: n и k.

Напишите программу, которая удаляет k цифр из числа n так, чтобы новое число было наименьшим из возможных.

**Формат входных данных**

На вход подается два числа: n и k.

**Формат выходных данных**

Программа должна вывести число, в соответствии с условием задачи.

_**Примечание**_. Считайте, что число k меньше количества разрядов числа n.

**Sample Input 1:**
```
351372111
3
```
**Sample Output 1:**
```
132111
```
**Sample Input 2:**
```
70600
1
```
**Sample Output 2:**
```
600
```
**Sample Input 3:**
```
100
2
```
**Sample Output 3:**
```
0
```
**Sample Input 4:**
```
10
1
```
**Sample Output 4:**
```
0
```
**Sample Input 5:**
```
1234
3
```
**Sample Output 5:**
```
1
```
# Решение/Solution

```
n = list(map(int, input()))
k = int(input())
len_n = len(n)
min = list(n)
count = 1
while len(n) > len_n - k:

    for i in n:
        tmp = list(n)
        tmp.remove(i)
        if tmp < min:
            min = tmp
            n = list(tmp)
            break
    count += 1
res = ''.join(list(map(str, n)))
print(int(res))
```
