# 7.9 Вложенные циклы. Часть 2
# Делители-2
На вход программе подается натуральное число nn. Напишите программу, выводящую графическое изображение делимости чисел от 11 до nn включительно. В каждой строке надо напечатать очередное число и столько символов «+», сколько делителей у этого числа.

**Формат входных данных**

На вход программе подается одно натуральное число.

**Формат выходных данных**

Программа должна вывести графическое изображение чисел от 11 до nn, каждое на отдельной строке.

**Sample Input:**
```
5
```
**Sample Output:**
```
1+
2++
3++
4+++
5++
```

# Solution
```python
b = int(input())
max_sum = 0

for i in range(1, b + 1):
    summ, count = 0, 0
    for j in range(1, b + 1):
        if i % j == 0:
            summ += j
            count += 1
            if summ > max_sum:
                max_sum = summ
    print(i, "+" * count, sep='')
```