# Number sequence
Напишите программу, которая выводит nn первых элементов последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 ... (число повторяется столько раз, чему равно).

**Формат ввода:**

Строка, содержащая одно целое число n, n > 0.

**Формат вывода:**

Строка, содержащая требуемую последовательность чисел, разделённых пробелом.

**Sample Input:**

`7`

**Sample Output:**

`1 2 2 3 3 3 4`
# Решение/Solution

```
n = int(input())
result = []
res = [[j] * j for j in range(1, n + 1)]
for i in res:
    for j in i:
        result.append(j)
print(*result[:n])
```
