# 5.19 Find a substring
Напишите программу, которая находит все позиции вхождения подстроки в строку.

**Формат ввода**:

На первой строке содержится исходная строка, на второй строке ввода указана подстрока, позиции которой требуется найти. Строки состоят из символов латинского алфавита.

**Формат вывода**:

Строка, содержащая индексы (индексация начинается с нуля) вхождения подстроки в строку, разделённые пробелом или число -1 в случае, когда подстрока не найдена.

**Sample Input 1**:

```
abacabadaba
aba
```

**Sample Output 1**:

`0 4 8`

**Sample Input 2**:

```
aaaa
aa
```

**Sample Output 2**:

`0 1 2`

**Sample Input 3**:

```
abc
d
```

**Sample Output 3**:

`-1`

# Solution/Решение

```
st, letter, res = input(), input(), []
for i in range(len(st)):
    x = st.find(letter, i)
    res.append(x)

if len(set(res)) == 1 and set(res) == {-1}:
    print(*sorted(set(res)))

elif -1 in sorted(set(res)):
    print(*sorted(set(res))[1:])

else:
    print(*sorted(set(res))[:])
```
