# 5.20 Game of life

Напишите программу, вычисляющую следующее состояние поля для Game of life. 

Поле представляет собой прямоугольник, причём для крайних клеток поля соседними являются клетки с противоположного конца (поле представляет собой тор).

**Формат ввода**:

На первой строке указаны два целых числа через пробел -- высота и ширина поля. В следующих строках подаётся состояние поля. Точка "." обозначает мёртвую клетку, символ "X" − живую. 

**Формат вывода**:

Следующее состояние поля, используя те же обозначения, что использовались на вводе.

**Sample Input 1**:

```
5 5
.....
..X..
...X.
.XXX.
.....
```

**Sample Output 1**:

```
.....
.....
.X.X.
..XX.
..X..
```

**Sample Input 2**:

```
5 5
.....
.....
.XXX.
.....
.....
```

**Sample Output 2**:

```
.....
..X..
..X..
..X..
.....
```

**Sample Input 3**:

```
5 6
...XX.
.XX...
..X...
XX....
X..XX.
```

**Sample Output 3**:

```
.X..XX
.XX...
X.X...
XXXX.X
XXXXX.
```

# Solution
```python
m, n = map(int, input().split())
arr1 = [list(input()) for i in range(m)]
arr2 = [['.' for i in range(n)] for i in range(m)]

for i in range(m):
    for j in range(n):
        if arr1[i][j] == '.' and [arr1[(i - 1)][j - 1], arr1[i - 1][j], arr1[i - 1][(j + 1) % n], arr1[i][(j + 1) % n],
                                  arr1[i][j - 1], arr1[(i + 1) % m][j - 1], arr1[(i + 1) % m][j],
                                  arr1[(i + 1) % m][(j + 1) % n]].count('X') == 3:
            arr2[i][j] = 'X'
        elif arr1[i][j] == 'X' and [arr1[(i - 1)][j - 1], arr1[i - 1][j], arr1[i - 1][(j + 1) % n],
                                    arr1[i][(j + 1) % n], arr1[i][j - 1], arr1[(i + 1) % m][j - 1],
                                    arr1[(i + 1) % m][j], arr1[(i + 1) % m][(j + 1) % n]].count('X') in [2, 3]:
            arr2[i][j] = 'X'
        else:
            arr2[i][j] = '.'

[print(*i, sep='') for i in arr2]
```
