# 7.1 Minesweeper field
Поле для игры сапёр представляет собой сетку размером *n×m*
. В ячейке сетки может находиться или отсутствовать мина. 

Напишите программу, которая выводит "решённое" поле, т.е. для каждой ячейки, не являющейся миной, указывается число мин, находящихся в соседних ячейках (учитывая диагональные направления)

**Формат ввода**:

На первой строке указываются два натуральных числа *1≤n,m≤100*
, после чего в *n* строках содержится описание поля в виде последовательности точек '.' и звёздочек '*', где точка означает пустую ячейку, а звёздочка − ячейку с миной.

**Формат вывода**:

*n* строк поля, в каждой ячейке которого будет либо число от 0 до 8, либо мина (обозначенная символом "*"), при этом число означает количество мин в соседних ячейках поля.

---

**Sample Input**:

```
4 4
..*.
**..
..*.
....
```

**Sample Output**:

```
23*1
**32
23*1
0111
```

# Solution/Решение


```python
n, m = list(map(int, input().split()))
field = []
for i in range(n):
    # вбиваем введенный массив
    field.append(list(input()))

    # добавляем дополнительные столбики
    field[i].insert(0, '_')
    field[i].append('_')

# добавляем дополнительные строки
field.insert(0, ['_' for i in range(len(field[i]))])
field.append(['_' for i in range(len(field[i]))])

for i in range(1, n + 1):
    for j in range(1, m + 1):

        # если мины нет - считаем их число вокруг
        if field[i][j] != "*":

            # присваиваем точке число мин вокруг
            field[i][j] = [field[i - 1][j - 1] == '*', field[i - 1][j] == '*', field[i - 1][j + 1] == '*',
                           field[i][j - 1] == '*', field[i][j + 1] == '*', field[i + 1][j - 1] == '*',
                           field[i + 1][j] == '*', field[i + 1][j + 1] == '*'].count(True)

            # выводим это число
            print(field[i][j], end="")

        # если мина - то выводим
        else:
            print('*', end="")
    print()
```
