# 5.1 Оператор цикла while

Подвиг 12. Составить программу поиска всех трехзначных чисел, которые при делении на 47 дают в остатке 43 и кратны 3. Вывести найденные числа в строчку через пробел. Программу реализовать при помощи цикла while.

**Sample Input:**

**Sample Output:**
```
231 372 513 654 795 936
```
# Solution
```python
n = 100
while n < 1000:
    if n % 47 == 43 and n % 3 == 0:
        print(n, end = " ")
    n += 1
```