# The Zen of Python

Вам доступен текстовый файл pythonzen.txt, содержащий текст на английском языке:

```python
The Zen of Python, by Tim Peters

Beautiful is better than ugly.
Explicit is better than implicit.
...
```

Напишите программу, которая определяет, сколько раз встречается каждая буква в этом тексте. Буквы и их количество должны
выводиться в лексикографическом порядке, каждая на отдельной строке, в следующем формате:

```python
<буква>: <количество>
```

**Примечание 1.** Начальная часть ответа выглядит так:

```python
a: 53
b: 21
...
```

**Примечание 2.** Программа не должна учитывать регистр, то есть, например, буквы a и A считаются одинаковыми.

**Примечание 3.** Программа должна игнорировать все небуквенные символы.

**Примечание 4.** Указанный файл доступен по ссылке. Ответ на задачу доступен по ссылке.

**Примечание 5.** При открытии файла используйте явное указание кодировки UTF-8.

# Solution

```python
from collections import Counter

with open('pythonzen.txt') as file:
    count = Counter(''.join(i.lower() for i in file.read() if i.isalpha()))
    for k, v in sorted(count.items()):
        print(f'{k}: {v}')
```