# В поисках слов 🥳

Дана последовательность слов. Напишите программу, которая выводит наиболее часто встречаемое слово в этой
последовательности. Если таких слов несколько, программа должна вывести то, которое больше в лексикографическом
сравнении.

**Формат входных данных**
На вход программе подается последовательность слов, разделенных пробелом.

**Формат выходных данных**
Программа должна определить наиболее часто встречаемое слово в введенной строке и вывести его в нижнем регистре. Если
таких слов несколько, программа должна вывести то, которое больше в лексикографическом сравнении, так же в нижнем в
регистре.

**Примечание 1.** Программа должна игнорировать регистр. То есть, например, слова Python и python считаются одинаковыми.

**Sample Input 1:**

```python
Арбуз Малина арбуЗ Клубника арбуз банан малина черешня вишня арбуз клубника Банан
```

**Sample Output 1:**

```python
арбуз
```

**Sample Input 2:**

```python
МаЛиНа клубника Арбуз банаН Малина Черешня вишня арбуз клубника банан
```

**Sample Output 2:**

```python
малина
```

**Sample Input 3:**

```python
малина малина клубника арбуз банан малина черешня вишня арбуз клубника банан малина
```

**Sample Output 3:**

```python
малина
```

# Solution

```python
from collections import Counter

string = Counter(input().lower().split())
print(sorted(x for x in string if string[x] == max(string.values()))[-1])
```