# Бесплатные курсы берут свое 😢

Для дополнительного заработка Тимур решил заняться продажей овощей. У него имеются данные о продажах за год, разделенные
на четыре файла по кварталам: quarter1.csv, quarter2.csv, quarter3.csv и quarter4.csv. В каждом файле в первом столбце
указывается название продукта, а в последующих — количество проданного продукта в килограммах за определенный месяц:

```python
продукт,январь,февраль,март
Картофель,39,61,3
Дайкон,51,96,83
...
```

Также присутствует файл prices.json, содержащий словарь, в котором ключом является название продукта, а значением — цена
за килограмм в рублях:

```python
{
   "Картофель": 53,
   "Дайкон": 55,
...
}
```

Напишите программу, которая выводит единственное число — сумму, заработанную Тимуром за год на продаже овощей.

# Solution

```python
import csv
import json
from collections import Counter


def count(filename):
    with open(filename, encoding='utf-8') as file:
        fields, *lst = csv.reader(file)
        return Counter({k: sum(map(int, v)) for k, *v in lst})


quarters = ['quarter1.csv', 'quarter2.csv', 'quarter3.csv', 'quarter4.csv']
all_count = sum(map(count, quarters), start=Counter())

with open('prices.json', encoding='utf-8') as json_file:
    summ, prices = 0, json.load(json_file)
    for k, v in prices.items():
        summ += v * all_count[k]

    print(summ)
```