# В поисках слов 😋

Дана последовательность слов. Напишите программу, которая выводит наименее часто встречаемое слово в этой
последовательности. Если таких слов несколько, программа должна вывести их все.

**Формат входных данных**

На вход программе подается последовательность слов, разделенных пробелом.

**Формат выходных данных**

Программа должна определить наименее часто встречаемое слово в введенной последовательности и вывести его в нижнем
регистре. Если таких слов несколько, программа должна вывести их все в лексикографическом порядке, в нижнем регистре,
разделяя запятой.

**Примечание 1.** Программа должна игнорировать регистр. То есть, например, слова Python и python считаются одинаковыми.

**Sample Input 1:**

```python
Арбуз Малина Малина Арбуз Клубника арбуз банан малина вишня черешня вишня арбуЗ
```

**Sample Output 1:**

```python
банан, клубника, черешня
```

**Sample Input 2:**

```python
арбуз МалинА клубника Банан Вишня Черешня
```

**Sample Output 2:**

```python
арбуз, банан, вишня, клубника, малина, черешня
```

**Sample Input 3:**

```python
арбуз черешня малина малина арбуз арбуз Банан малина вишня черешня вишня арбуз
```

**Sample Output 3:**

```python
банан
```

# Solution

```python
from collections import Counter

string = Counter(input().lower().split())
print(*sorted(x for x in string if string[x] == min(string.values())), sep=', ')
```