10.3 Методы словарей
Самое редкое слово 🌶️
На вход программе подается строка текста. Напишите программу, которая выводит слово, которое встречается реже всего, без учета регистра. Если таких слов несколько, выведите то, которое меньше в лексикографическом порядке.

Формат входных данных

На вход программе подается строка текста.

Формат выходных данных

Программа должна вывести слово (в нижнем регистре), встречаемое реже всего.

Примечание 1. Программа не должна быть чувствительной к регистру, слова apple и Apple должна воспринимать как одинаковые.

Примечание 2. Слово — последовательность букв. Кроме слов в тексте могут присутствовать пробелы и знаки препинания .,!?:;-, которые нужно игнорировать. Других символов в тексте нет.

**Sample Input 1:**
```
home sweet home
```
**Sample Output 1:**
```
sweet
```
**Sample Input 2:**
```
home sweet home sweet.
```
**Sample Output 2:**
```
home
```
# Solution
```python
import re

s = re.sub(r"[.,!?:;-]", "", input()).lower().split()

result = {}
for i in s:
    result[i] = s.count(i)
print(sorted([i for i in result if result.get(i) == min(result.values())])[0])
```