# 11.2 Часть 2
# Опасный вирус 😈
В файловую систему компьютера, на котором развернута наша ❤️ платформа Stepik, проник опасный вирус и сломал контроль прав доступа к файлам. Говорят, вирус написал один из студентов курса Python для начинающих.

Для каждого файла известно, с какими действиями можно к нему обращаться:

* запись W (write, доступ на запись в файл);
* чтение R (read, доступ на чтение из файла);
* запуск X (execute, запуск на исполнение файла).
Напишите программу для восстановления контроля прав доступа к файлам. Ваша программа для каждого запроса должна будет возвращать OK если выполняется допустимая операция, и Access denied, если операция недопустима.

**Формат входных данных**

Программа получает на вход количество файлов nn, содержащихся в файловой системе компьютера. Далее идет nn строк, на каждой имя файла и допустимые с ним операции, разделенные символом пробела. В следующей строке записано число mm — количество запросов к файлам, и затем mm строк с запросами вида операция файл. Одному и тому же файлу может быть адресовано любое количество запросов.

**Формат выходных данных**

Программа должна вывести для каждого из mm запросов в отдельной строке Access denied или OK.


**Sample Input 1:**
```
5
my_pycode.exe W X
log_n X W R
ave R
lucky_m W R
dnsss.py W
6
execute ave
read dnsss.py
write log_n
execute log_n
read ave
write my_pycode.exe
```
**Sample Output 1:**
```
Access denied
Access denied
OK
OK
OK
OK
```
**Sample Input 2:**
```
2
marvel_movies X
dc_com X R
2
execute dc_com
write dc_com
```
**Sample Output 2:**
```
OK
Access denied
```
# Solution
```python
kod = {'execute': 'X', 'read': 'R', 'write': 'W'}
n = int(input())
a = []
for i in range(n):
    a.append(input().split())
    a[i] = {a[i][0]: a[i][1::]}
m = int(input())
b = []

for i in range(m):
    b.append(input().split())
    b[i][0] = kod.get(b[i][0])

for i in b:
    for j in a:
        if j.get(i[1]) is not None:
            print(['Access denied', "OK"][i[0] in j.get(i[1])])

```