# 12.2 Модуль random. Часть 2 
# Тайный друг 🌶️
Напишите программу, которая случайным образом назначает каждому ученику его тайного друга, который будет вместе с ним решать задачи по программированию.

**Формат входных данных**

На вход программе в первой строке подается число nn – общее количество учеников. Далее идут nn строк, содержащих имена и фамилии учеников.

**Формат выходных данных**

Программа должна вывести имя и фамилию ученика (в соответствии с исходным порядком) и имя и фамилию его тайного друга, разделённые дефисом.

Примечание 1. Обратите внимание, что нельзя быть тайным другом самому себе и нельзя быть тайным другом для нескольких учеников.

Примечание 2. Приведенные ниже тесты это лишь образцы возможного ответа. Возможны и другие способы выбора тайных друзей.


**Sample Input 1:**

3
Светлана Зуева
Аркадий Белых
Борис Боков

**Sample Output 1:**

Светлана Зуева - Борис Боков
Аркадий Белых - Светлана Зуева
Борис Боков - Аркадий Белых

**Sample Input 2:**

5
Владимир Смолов
Тагир Хан
Давид Лавров
Арина Приходько
Глеб Анисимов

**Sample Output 2:**

Владимир Смолов - Тагир Хан
Тагир Хан - Арина Приходько
Давид Лавров - Глеб Анисимов
Арина Приходько - Владимир Смолов
Глеб Анисимов - Давид Лавров

**Sample Input 3:**

2
Руслан Адашев
Святослав Герасимов

**Sample Output 3:**

Руслан Адашев - Святослав Герасимов
Святослав Герасимов - Руслан Адашев

# Solution
```python
from random import *

n, names, names2 = int(input()), [], []
for i in range(n):
    names2.append(input())
names = list.copy(names2)
shuffle(names2)
for j in range(n):
    for i in range(n):
        while names[i] == names2[i]:
            shuffle(names2)
for i in range(n):
    print(names[i], "-", names2[i])
```