# 4.3 Вложенные списки. Часть 2
# Упаковка дубликатов 🌶️
На вход программе подается строка текста, содержащая символы. Напишите программу, которая упаковывает последовательности одинаковых символов заданной строки в подсписки.

**Формат входных данных**

На вход программе подается строка текста, содержащая символы, отделенные символом пробела.

**Формат выходных данных**

Программа должна вывести указанный вложенный список.


**Sample Input 1:**
```
a b c d
```
**Sample Output 1:**
```
[['a'], ['b'], ['c'], ['d']]
```
**Sample Input 2:**
```
w w w o r l d g g g g r e a t t e c c h e m g g p w w
```
**Sample Output 2:**
```
[['w', 'w', 'w'], ['o'], ['r'], ['l'], ['d'], ['g', 'g', 'g', 'g'], ['r'], ['e'], ['a'], ['t', 't'], ['e'], ['c', 'c'], ['h'], ['e'], ['m'], ['g', 'g'], ['p'], ['w', 'w']]
```
**Sample Input 3:**
```
g i v e t h h i i s m a a a n a g u u n
```
**Sample Output 3:**
```
[['g'], ['i'], ['v'], ['e'], ['t'], ['h', 'h'], ['i', 'i'], ['s'], ['m'], ['a', 'a', 'a'], ['n'], ['a'], ['g'], ['u', 'u'], ['n']]
```

# Solution
```python
s = input().split()
a = [s[0]]
count = 1
for i in s[1:]:
    if i == a[-1]:
        count += 1
    else:
        a[-1] = [a[-1]] * count
        count = 1
        a.append(i)
a[-1] = [a[-1]] * count
print(a)
```