# 4.5 Матрицы. Часть 2
# Магический квадрат 🌶️
Магическим квадратом порядка nn называется квадратная таблица размера n \times nn×n, составленная из всех чисел 1,2,3,…,n^2 так, что суммы по каждому столбцу, каждой строке и каждой из двух диагоналей равны между собой. Напишите программу, которая проверяет, является ли заданная квадратная матрица магическим квадратом.

**Формат входных данных**

На вход программе подаётся натуральное число nn — количество строк и столбцов в матрице, затем элементы матрицы: nn строк, по nn чисел в каждой, разделённые пробелами.

**Формат выходных данных**

Программа должна вывести слово YES, если матрица является магическим квадратом, и слово NO в противном случае.

**Sample Input 1:**
```
3
8 1 6
3 5 7
4 9 2
```
**Sample Output 1:**
```
YES
```
**Sample Input 2:**
```
3
8 2 6
3 5 7
4 9 1
```
**Sample Output 2:**
```
NO
```
**Sample Input 3:**
```
3
4 9 2
3 5 7
8 1 6
```
**Sample Output 3:**
```
YES
```
# Solution

```python
n = int(input())
a, res = [], []
summ1, summ2 = 0, 0

for i in range(n):
    a.append(input().split())

for i in range(n):
    a[i] = list(map(int, a[i]))

for i in range(n):
    res.append(sum(a[i]))
    summ = 0
    for j in range(n):
        summ += a[i][j]
        if i == j:
            summ1 += a[i][j]
        if i + j + 1 == n:
            summ2 += a[i][j]
    res.append(summ)

res.append(summ1)
res.append(summ2)
b = [i for i in range(1, n ** 2 + 1)]
sumb = sum(b)
suma = sum([sum(i) for i in a])
flag = all(res[i] == res[i + 1] for i in range(len(res) - 1))

if flag and sumb == suma and a[0] != a[1]:
    print("YES")
else:
    print("NO")
```