# Панорамное агентство

По чатам одного немалоизвестного мессенджера начали появляться новости сомнительного содержания. Оказалось, что некий
молодежный клуб решил подшутить, распространяя всякие глупости. Однако подобное хулиганство мешает доверчивым людям,
особенно пенсионного возраста, поэтому группа независимых программистов решила разработать бота, который мог бы оценить
степень достоверности новости, а также отнести её к какой-либо категории.

Напишите программу, которая выводит все новости заданной категории, располагая их по возрастанию степени достоверности.

**Формат входных данных**

На вход программе подается произвольное количество строк, в каждой строке, кроме последней, записана новость, категория,
к которой она относится, и ее достоверность в следующем формате:

```python
< новость > / < категория > / < достоверность >
```

В последней строке подается одиночная категория.

**Формат выходных данных**

Программа должна вывести все новости, которые относятся к введенной категории. Новости должны быть расположены в порядке
возрастания степени достоверности, а при совпадении степеней достоверности — в лексикографическом порядке самих
новостей.

**Sample Input:**

```python
На
рейсах
Поражения
второй
пилот
будет
исполнять
обязанности
бортпроводника / Авиация / 0.3
Огурец
исключит
из
своих
рядов
членов, не
проголосовавших
за
Единую
Арстоцку
на
выборах / Политика / 0.8
Орбистанские
точки
общепита
будут
закрыты
для
вакцинированных
граждан / Общество / 0.7
Джорджи
Костава
получил
членский
билет
Независимого
Кобрастана / Политика / 0.0
В
Колечии
повысят
призывной
возраст
до
40
лет / Политика / 1.0
Всем
гражданам
Антегрии
въезд
в
Арстоцку
запрещен / Политика / 0.8
Политика
```

**Sample Output:**

```python
Джорджи
Костава
получил
членский
билет
Независимого
Кобрастана
Всем
гражданам
Антегрии
въезд
в
Арстоцку
запрещен
Огурец
исключит
из
своих
рядов
членов, не
проголосовавших
за
Единую
Арстоцку
на
выборах
В
Колечии
повысят
призывной
возраст
до
40
лет
```

# Solution

```python
import sys

*std_in, tag = sorted(map(lambda st: st.strip().split('/'), sys.stdin))
for st in sorted(filter(lambda s: s[1].strip() == tag[0], std_in), key=lambda x: (x[2], x)):
    print(st[0].strip())
```