# Размах данных

Дана последовательность дат. Напишите программу, которая выводит количество дней между максимальной и минимальной датами
данной последовательности.

**Формат входных данных**

На вход программе подается произвольное количество строк, в каждой строке записана дата в ISO формате (YYYY-MM-DD).

**Формат выходных данных**

Программа должна вывести единственное число — количество дней между максимальной и минимальной датами введенной
последовательности.

**Sample Input 1:**

```python
2022-06-15
2022-06-12
2022-06-16
2022-06-30
```

**Sample Output 1:**

```python
18
```

**Sample Input 2:**

```python
2077-01-01
2077-01-01
2077-01-01
```

**Sample Output 2:**

```python
0
```

# Solution

```python
import sys
from datetime import date

dates = [date.fromisoformat(line.strip()) for line in sys.stdin.readlines()]
print((max(dates) - min(dates)).days)
```