# Гуру прогрессий

Дана последовательность целых чисел. Напишите программу, которая определяет, является ли данная последовательность
прогрессией, и если да, то определяет её вид.

**Формат входных данных**

На вход программе подается произвольное количество строк (не менее трёх), в каждой строке записано натуральное число —
очередной член последовательности.

**Формат выходных данных**

Программа должна вывести текст:

* Арифметическая прогрессия, если введенная последовательность чисел является арифметической прогрессией
* Геометрическая прогрессия, если введенная последовательность чисел является геометрической прогрессией
* Не прогрессия, если введенная последовательность чисел не является прогрессией

**Примечание 1.** Гарантируется, что вид прогрессии определяется однозначно.

**Примечание 2**. Подробнее об арифметической и геометрической прогрессиях тут и тут соответственно.

**Sample Input 1:**

```python
1
2
3
4
5
```

**Sample Output 1:**

```python
Арифметическая прогрессия
```

**Sample Input 2:**

```python
2
4
8
16
```

**Sample Output 2:**

```python
Геометрическая прогрессия
```

**Sample Input 3:**

```python
1
9
1
1
4
5
```

**Sample Output 3:**

```python
Не прогрессия
```

# Solution

```python
import sys

inp_ = list(map(lambda st: int(st.strip()), sys.stdin))
arithmetic = [inp_[i + 1] - inp_[i] for i in range(len(inp_[:-1]))]
geometric = [inp_[i + 1] / inp_[i] for i in range(len(inp_[:-1]))]

if len(set(arithmetic)) == 1:
    print('Арифметическая прогрессия')
elif len(set(geometric)) == 1:
    print('Геометрическая прогрессия')
else:
    print('Не прогрессия')
```