# Скидки

Наступил ноябрь, и во многих магазинах начались распродажи, но как многим известно, зачастую товары со скидкой
оказываются дороже, чем без нее. Вам доступен файл sales.csv, который содержит данные о ценообразовании различной
бытовой техники. В первом столбце записано название товара, во втором — старая цена, в третьем — новая цена со скидкой:

```python
name;
old_price;
new_price
Встраиваемая
посудомоечная
машина
De
'Longhi DDW 06S;23089;31862
Вытяжка
Falmec
Afrodite
60 / 600;
27694;
18001
...
```

Напишите программу, которая выводит названия тех товаров, цена на которые уменьшилась. Товары должны быть расположены в
своем исходном порядке, каждый на отдельной строке.

**Примечание 1.** Разделителем в файле sales.csv является точка с запятой, при этом кавычки не используются.

**Примечание 2.** Указанный файл доступен по ссылке. Ответ на задачу доступен по ссылке.

**Примечание 3.** Начальная часть ответа выглядит так:

```python
Вытяжка
Falmec
Afrodite
60 / 600
Духовой
шкаф
AEG
BS
5836600
Вытяжка
MAUNFELD
PLYM
60
...
```

**Примечание 4.** При открытии файла используйте явное указание кодировки UTF-8.

# Solution

```python
import csv

with open("sales.csv", encoding='utf-8') as csv_file:
    rows = csv.reader(csv_file, delimiter=';')
    for name, old_price, new_price in rows:

        if name != 'name' and float(old_price) > float(new_price):
            print(name)
```