# Последний день на Титанике

Вам доступен файл titanic.csv, который содержит данные о пассажирах, присутствовавших на борту парохода Титаник. В
первом столбце указана единица, если пассажир выжил, и ноль в противном случае, во втором столбце записано полное имя
пассажира, в третьем — пол, в четвертом — возраст:

```python
survived;name;sex;age
0;Mr. Owen Harris Braund;male;22
1;Mrs. John Bradley (Florence Briggs Thayer) Cumings;female;38
...
```

Напишите программу, которая выводит имена выживших пассажиров, которым было менее 18 лет, каждое на отдельной строке.
Причем сначала должны быть расположены имена всех пассажиров мужского пола, а затем — женского, имена же непосредственно
в мужском и женском списках должны быть расположены в своем исходном порядке.

**Примечание 1.** Разделителем в файле titanic.csv является точка с запятой, при этом кавычки не используются.

**Примечание 2.** Указанный файл доступен по ссылке. Ответ на задачу доступен по ссылке.

**Примечание 3.** Часть ответа выглядит так:

```python
Master. Gerios Moubarek
Master. Alden Gates Caldwell
...
Master. Harold Theodor Johnson
Mrs. Nicholas (Adele Achem) Nasser
Miss. Marguerite Rut Sandstrom
...
```

**Примечание 4.** При открытии файла используйте явное указание кодировки UTF-8.

# Solution

```python
import csv

men, women = [], []
with open(r"titanic.csv", encoding='utf-8') as file:
    columns, *csv_reader = csv.reader(file, delimiter=';')
    for survived, name, sex, age in csv_reader:
        if int(survived) and float(age) < 18:
            if sex == 'male':
                men.append(name)
            else:
                women.append(name)
                
print(*men, sep='\n')
print(*women, sep='\n')
```