# Голодный студент 🌶️

Дима очень хочет поесть, но денег у него мало. Помогите ему определить самый дешевый продукт, а также магазин, в котором
он продается. Вам доступен файл prices.csv, который содержит информацию о ценах продуктов в различных магазинах. В
первом столбце записано название магазина, а в последующих — цена на соответствующий товар в этом магазине:

```python
Магазин;
Творог;
Гречка;
Рис;
Бородинский
хлеб;
Яблоки;
Пельмени;
Овсяное
печенье;
Спагетти;
Печеная
фасоль;
Мороженое;
Фарш;
Вареники;
Картофель;
Батончик
Пятерочка;
69;
133;
129;
83;
141;
90;
72;
123;
149;
89;
88;
106;
54;
84
Магнит;
102;
87;
95;
75;
109;
112;
97;
82;
101;
134;
69;
61;
141;
79
...
```

Напишите программу, которая определяет и выводит самый дешевый продукт и название магазина, в котором он продается, в
следующем формате:

```python
< название
продукта >: < название
магазина >
```

Если имеется несколько самых дешевых товаров, то следует вывести тот товар, чье название меньше в лексикографическом
сравнении. Если один товар продается в нескольких магазинах по одной минимальной цене, то следует вывести тот магазин,
чье название меньше в лексикографическом сравнении.

**Примечание 1.** Разделителем в файле prices.csv является точка с запятой, при этом кавычки не используются.

**Примечание 2.** Указанный файл доступен по ссылке. Ответ на задачу доступен по ссылке.

**Примечание 3.** Пример вывода:

```python
Клубничный
йогурт: ВкусВилл
```

**Примечание 4.** При открытии файла используйте явное указание кодировки UTF-8.

# Solution

```python
import csv

with open("prices.csv", encoding='utf-8') as file_in:
    rows = list(csv.DictReader(file_in, delimiter=';'))
    lst = [(row['Магазин'], *min(list(row.items())[1:], key=lambda x: int(x[1]))) for row in rows]
    magaz, item, _ = sorted(lst, key=lambda x: (-int(x[2]), x[0]), reverse=True)[0]
    print(f'{item}: {magaz}')
```