# Элементы JSON

Напишите программу, которая принимает на вход описание одного объекта в формате JSON и выводит все пары ключ-значение
этого объекта.

**Формат входных данных**
На вход программе подается корректное описание одного объекта в формате JSON.

**Формат выходных данных**
Программа должна вывести все пары ключ-значение введенного объекта, разделяя ключ и значение двоеточием, каждую на
отдельной строке. Если значением ключа является список, то все его элементы должны быть выведены через запятую.

**Примечание 1.** Пары ключ-значение при выводе должны располагаться в своем исходном порядке.

**Примечание 2.** Для считывания произвольного числа строк используйте потоковый ввод sys.stdin.

**Sample Input 1:**

```python
{"size": 36, "style": "bold", "name": "text1", "alignment": "center"}
```

**Sample Output 1:**

```python
size: 36
style: bold
name: text1
alignment: center
```

**Sample Input 2:**

```python
{
"type": "donut", 
"name": "Cake", 
"tastes": ["chocolate", "cream", "strawberry"]
}
```

**Sample Output 2:**

```python
type: donut
name: Cake
tastes: chocolate, cream, strawberry
```

# Solution

```python
import json
import sys

for k, v in json.loads(sys.stdin.read()).items():
    print(f'{k}: {", ".join(map(str, v)) if type(v) == list else v}')
```