# Общественное питание 😰

Вам доступен файл food_services.json, содержащий список JSON-объектов, которые представляют данные о заведениях
общественного питания:

```python
[
   {
      "Name": "СМЕТАНА",
      "IsNetObject": "нет",
      "OperatingCompany": "",
      "TypeObject": "кафе",
      "AdmArea": "Северо-Восточный административный округ",
      "District": "Ярославский район",
      "Address": "город Москва, улица Егора Абакумова, дом 9",
      "SeatsCount": 48
   },
   ...
]
```

Под «заведением» будем подразумевать один JSON-объект из этого списка. У заведения имеются следующие атрибуты:

* Name — название
* IsNetObject — да\нет в зависимости от того, является ли заведение сетевым
* OperatingCompany — название сети
* TypeObject — вид (кафе, столовая, ресторан и т.д.)
* AdmArea — административная зона
* District — район
* Address — полный адрес
* SeatsCount — количество посадочных мест

Напишите программу, которая определяет все виды заведений и для каждого вида находит самое большое заведение этого
вида (имеет наибольшее количество посадочных мест). Программа должна вывести все виды заведений в лексикографическом
порядке, указав для каждого самое большое заведение и количество посадочных мест в нем. Данные о заведениях должны быть
расположены каждые на отдельной строке, в следующем формате:

```python
<вид заведения>: <название заведения>, <количество посадочных мест>
```

**Примечание 1.** Начальная часть ответа выглядит так:

```python
бар: Барное объединение ПРОФСОЮЗ, 800
буфет: СТОЛОВАЯ - КАНТИНАСИТИ, 320
закусочная: Бургерная FARШ, 74
...
```

**Примечание 2.** Указанный файл доступен по ссылке. Ответ на задачу доступен по ссылке.

**Примечание 3.** При открытии файла используйте явное указание кодировки UTF-8.

# Solution

```python
import json

seats = {}

with open("food_services.json", encoding='utf-8') as file:
    data = json.load(file)
    for object in data:
        seats.setdefault(object['TypeObject'], {'name': object['Name'], 'max_seats': object['SeatsCount']})
        if object['SeatsCount'] > seats[object['TypeObject']]['max_seats']:
            seats[object['TypeObject']]['name'] = object['Name']
            seats[object['TypeObject']]['max_seats'] = object['SeatsCount']

    for obj, descr in sorted(seats.items()):
        print(f'{obj}: {descr["name"]}, {descr["max_seats"]}')
```