# Общественное питание 😥

Вам доступен файл food_services.json, содержащий список JSON-объектов, которые представляют данные о заведениях
общественного питания:

```python

[
   {
      "Name": "СМЕТАНА",
      "IsNetObject": "нет",
      "OperatingCompany": "",
      "TypeObject": "кафе",
      "AdmArea": "Северо-Восточный административный округ",
      "District": "Ярославский район",
      "Address": "город Москва, улица Егора Абакумова, дом 9",
      "SeatsCount": 48
   },
   ...
]
```

Под «заведением» будем подразумевать один JSON-объект из этого списка. У заведения имеются следующие атрибуты:

* Name — название
* IsNetObject — да\нет в зависимости от того, является ли заведение сетевым
* OperatingCompany — название сети
* TypeObject — вид (кафе, столовая, ресторан и т.д.)
* AdmArea — административная зона
* District — район
* Address — полный адрес
* SeatsCount — количество мест

Напишите программу, которая:

* определяет район Москвы, в котором находится больше всего заведений, и выводит название этого района и количество
  заведений в нем
* определяет сеть с самым большим числом заведений и выводит название этой сети и количество заведений этой сети

Полученные значения программа должна вывести в следующем формате:

```python
<район>: <количество заведений>
<название сети>: <количество заведений>
```

**Примечание 1.** Гарантируется, что искомая сеть единственная.

**Примечание 2.** Пример вывода:

```python
район Метрогородок: 456
Французская пекарня SeDelice: 144
```

**Примечание 3.** Указанный файл доступен по ссылке. Ответ на задачу доступен по ссылке.

**Примечание 4**. При открытии файла используйте явное указание кодировки UTF-8.

# Solution

```python
import json

net, districts = {}, {}
with open("food_services.json", encoding='utf-8') as file:
    data = json.load(file)
    for object in data:
        districts[object['District']] = districts.get(object['District'], 0) + 1
        if object['IsNetObject'] == 'да':
            net[object['OperatingCompany']] = net.get(object['OperatingCompany'], 0) + 1

    answer1, answer2 = max(districts, key=districts.get), max(net, key=net.get)
    print(f'{answer1}: {districts[answer1]}')
    print(f'{answer2}: {net[answer2]}')
```