# Шахматы были лучше 🌶️

Вам доступен архив data.zip, содержащий различные папки и файлы. Среди них есть несколько JSON файлов, каждый из которых
содержит информацию о каком-либо футболисте:

```python

{
   "first_name": "Gary",
   "last_name": "Cahill",
   "team": "Chelsea",
   "position": "Defender"
}
```

У футболиста имеются следующие атрибуты:

* first_name — имя
* last_name — фамилия
* team — название футбольного клуба
* position — игровая позиция

Напишите программу, которая обрабатывает только данные JSON файлы и выводит имена и фамилии футболистов, выступающих за
футбольный клуб Arsenal. Футболисты должны быть расположены в лексикографическом порядке имен, а при совпадении — в
лексикографическом порядке фамилий, каждый на отдельной строке.

**Примечание 1.** Обратите внимание, что наличие у файла расширения .json не гарантирует, что он является корректным
текстовым файлом в формате JSON. Для того чтобы определить, является ли файл корректным текстовым файлом в формате JSON,
воспользуйтесь конструкцией try-except и функцией is_correct_json() из предыдущего урока.

**Примечание 2.** Начальная часть ответа выглядит так:

```python
Alex Iwobi
Alexis Sanchez
...
```

# Solution

```python
import json
from zipfile import ZipFile

with ZipFile("data.zip") as zip_file:
    result = []
    for json_file in zip_file.infolist():
        if json_file.filename.endswith('.json'):
            with open(str(zip_file.extract(json_file)), encoding='utf-8') as js:
                try:
                    file_json = json.loads(js.read() )
                    if file_json['team'] == 'Arsenal':
                        result.append(f"{file_json['first_name']} {file_json['last_name']}")
                except:
                    continue


print(*sorted(result), sep='\n')
```