# Структура архива 🌶️🌶️

Вам доступен архив desktop.zip, содержащий различные папки и файлы. Напишите программу, которая выводит его файловую
структуру и объем каждого файла.

**Формат входных данных**

На вход программе ничего не подается.

**Формат выходных данных**

Программа должна вывести файловую структуру архива desktop.zip и объем каждого файла в несжатом виде. Так как архив
имеет собственную иерархию папок, каждый уровень вложенности должен быть выделен двумя пробелами.

**Примечание 1.** Вывод на примере архива test.zip из конспекта:

```python
test
  Картинки
    1.jpg 88 KB
    avatar.png 19 KB
    certificate.png 43 KB
    py.png 33 KB
    World_Time_Zones_Map.png 2 MB
    Снимок экрана.png 11 KB
  Неравенства.djvu 5 MB
  Программы
    image_util.py 5 KB
    sort.py 61 B
  Разные файлы
    astros.json 505 B
```

**Примечание 2.** Объем файла записывается в самых крупных единицах измерения с округлением до целых.

**Примечание 3.** Значения единиц измерения такие же, какие приняты в информатике:

```python
1 KB = 1024 B
1 MB = 1024 KB
1 GB = 1024 MB
```

# Solution

```python
import math
from zipfile import ZipFile


def convert_size(size_bytes):
    if size_bytes == 0:
        return "0B"
    size_name = ("B", "KB", "MB", "GB", "TB", "PB", "EB", "ZB", "YB")
    i = int(math.floor(math.log(size_bytes, 1024)))
    p = math.pow(1024, i)
    s = int(round(size_bytes / p, 0))
    return "%s %s" % (s, size_name[i])


with ZipFile("desktop.zip") as zip_file:
    for zinfo in zip_file.filelist:
        f = zinfo.filename
        if f.endswith('/'):
            print(f[:-1].count('/') * '  ' + f[:-1].split('/')[-1])
        else:
            print(f.count('/') * '  ' + f"{f.split('/')[-1]} {convert_size(zinfo.file_size)}")
```