# Количество файлов

Вам доступен архив workbook.zip, содержащий различные папки и файлы. Напишите программу, которая выводит единственное
число — количество файлов в этом архиве.

**Примечание 1.** Обратите внимание, что папка не считается файлом.

# Solution

```python
from zipfile import ZipFile

with ZipFile('workbook.zip') as file:
    print(len([fl for fl in file.infolist() if not fl.is_dir()]))
```