# Объем файлов

Вам доступен архив workbook.zip, содержащий различные папки и файлы. Напишите программу, которая выводит суммарный объем
файлов этого архива в сжатом и не сжатом видах в байтах, в следующем формате:

```python
Объем исходных файлов: <объем до сжатия> байт(а)
Объем сжатых файлов: <объем после сжатия> байт(а)
```

**Примечание 1**. Вывод на примере архива test.zip из конспекта:

```python
Объем исходных файлов: 7810260 байт(а)
Объем сжатых файлов: 7798267 байт(а)
```

# Solution

```python
from zipfile import ZipFile

with ZipFile('workbook.zip') as file:
    print(f'Объем исходных файлов: {sum([fl.file_size for fl in file.infolist()])} байт(а)')
    print(f'Объем сжатых файлов: {sum([fl.compress_size for fl in file.infolist()])} байт(а)')
```