# Быстрая сортировка
**Задача на программирование: точки и отрезки**


В первой строке задано два целых числа 1≤n≤50000 и 1≤m≤50000 — количество отрезков и точек на прямой, соответственно. Следующие n строк содержат по два целых числа a_i
  и b_i (a_i ≤b_i) — координаты концов отрезков. Последняя строка содержит m целых чисел — координаты точек. Все координаты не превышают 10^8
 по модулю. Точка считается принадлежащей отрезку, если она находится внутри него или на границе. Для каждой точки в порядке появления во вводе выведите, скольким отрезкам она принадлежит.





**Sample Input:**
```
2 3
0 5
7 10
1 6 11
```
**Sample Output:**
```
1 0 0
```

# Solution
```
n, m = [int(x) for x in input().split()]

a = []
for i in range(0, n):
    l, r = [int(x) for x in input().split()]
    a.append([l, -1])
    a.append([r, 1])

p = [int(x) for x in input().split()]
for i in range(m):
    a.append([p[i], 0, i])

a.sort()
res = [0] * m
curr = 0
pi = 0
for i in range(len(a)):
    if a[i][1] == 1:
        curr += -1
    if a[i][1] == -1:
        curr -= -1
    if a[i][1] == 0:
        res[a[i][2]] = curr

print(*res)
```