# 10.3 Методы словарей

# Исправление дубликатов 🌶️

На вход программе подается строка, содержащая строки-идентификаторы. Напишите программу, которая исправляет их так,
чтобы в результирующей строке не было дубликатов. Для этого необходимо прибавлять к повторяющимся идентификаторам
постфикс _n, где n – количество раз, сколько такой идентификатор уже встречался.

Формат входных данных

На вход программе подается строка текста, содержащая строки-идентификаторы, разделенные символом пробела.

Формат выходных данных

Программа должна вывести исправленную строку, не содержащую дубликатов сохранив при этом исходный порядок.

**Sample Input 1:**

```
a b c a a d c
```

**Sample Output 1:**

```
a b c a_1 a_2 d c_1
```

**Sample Input 2:**

```
a b c
```

**Sample Output 2:**

```
a b c
```

**Sample Input 3:**

```
i am i r o n m a n
```

**Sample Output 3:**

```
i am i_1 r o n m a n_1
```

**Sample Input 4:**

```
a a a a a
```

**Sample Output 4:**

```
a a_1 a_2 a_3 a_4
```

# Solution

```python
numbers = input().split()

result = {}
for num in numbers:
    if num not in result:
        result[num] = 1
        print(num, end=" ")
    else:
        result[num] += 1
        print(num + "_" + str(result[num] - 1), end=" ")

```