# 13.2 Модуль fractions

# Юный математик 🌶️

Дима учится в седьмом классе и сейчас они проходят обыкновенные дроби с натуральными числителем и знаменателем. Вчера на
уроке математики Дима узнал, что дробь называется правильной, если ее числитель меньше знаменателя, и несократимой, если
нет равной ей дроби с меньшими натуральными числителем и знаменателем.

Дима очень любит математику, поэтому дома он долго экспериментировал, придумывая и решая разные задачки с правильными
несократимыми дробями. Одну из этих задач Дима предлагает решить вам с помощью компьютера.

На вход программе подается натуральное число n. Напишите программу, которая находит наибольшую правильную несократимую
дробь с суммой числителя и знаменателя равной nn.

Формат входных данных

На вход программе подается натуральное число n.

Формат выходных данных

Программа должна вывести ответ на задачу.

Примечание. Возможно вам потребуется функция gcd(), которая позволяет находить наибольший общий делитель (НОД) двух
чисел. Функция реализована в модуле math.

**Sample Input 1:**

```
10
```

**Sample Output 1:**

```
3/7
```

**Sample Input 2:**

```
23
```

**Sample Output 2:**

```
11/12
```

**Sample Input 3:**

```
3
```

**Sample Output 3:**

```
1/2
```

# Solution

```python
from fractions import Fraction as F

n = int(input())
minn = 0
for i in range(1, n):
    for j in range(1, n):
        x = F(i, j)
        if i + j == n and i < j and x.numerator + x.denominator == n:
            if F(i, j) > minn:
                minn = F(i, j)
print(minn)
```