# 13.2 Модуль fractions

# Упорядоченные дроби

На вход программе подается натуральное число nn. Напишите программу, которая выводит в порядке возрастания все
несократимые дроби, заключённые между 0 и 1, знаменатель которых не превосходит n.

**Формат входных данных**

На вход программе подается натуральное число n, n > 1.

**Формат выходных данных**

Программа должна вывести ответ на задачу.

Примечание. Возможно вам потребуется функция gcd(), которая позволяет находить наибольший общий делитель (НОД) двух
чисел. Функция реализована в модуле math.

**Sample Input 1:**

```
5
```

**Sample Output 1:**

```
1/5
1/4
1/3
2/5
1/2
3/5
2/3
3/4
4/5
```

**Sample Input 2:**

```
4
```

**Sample Output 2:**

```
1/4
1/3
1/2
2/3
3/4
```

**Sample Input 3:**

```
3
```

**Sample Output 3:**

```
1/3
1/2
2/3
```

# Solution

```python
from fractions import Fraction as F

n = int(input())
x = sorted(list({F(i, j) for i in range(1, n + 1) for j in range(1, n + 1)}))
[print(i) for i in x if i < 1]
```