# 18.1 Итоговая работа

# Forbidden words 🌶️

На вход программе подается строка текста с именем текстового файла. Напишите программу, выводящую на экран содержимое
этого файла, но с заменой всех запрещенных слов звездочками * (количество звездочек равно количеству букв в слове).

Запрещенные слова, разделенные символом пробела, хранятся в текстовом файле forbidden_words.txt. Гарантируется, что все
слова в этом файле записаны в нижнем регистре.

**Формат входных данных**

На вход программе подается строка текста с именем существующего текстового файла, в котором необходимо заменить
запрещенные слова звездочками.

**Формат выходных данных**

Программа должна вывести текст в соответствии с условием задачи.

Примечание 1. Ваша программа должна заменить запрещенные слова, где бы они ни встречались, даже если они встречаются в
середине другого слова.

Примечание 2. Программа должна заменять запрещенные слова независимо от их регистра. Например, если файл
forbidden_words.txt содержит запрещенное слово exam, то слова exam, Exam, ExaM, EXAM и подобные должны быть заменены
на ****.

Примечание 3. Если бы файл forbidden_words.txt содержал слова:

```
hello email python the exam wor is
```

а файл в котором заменяются слова имел бы вид:

```
Hello, world! Python IS the programming language of thE future. My EMAIL is....
PYTHON is awesome!!!!
```

то результатом будет:

```
*****, ***ld! ****** ** *** programming language of *** future. My ***** **....
****** ** awesome!!!!
```

# Solution

```python
with open('forbidden_words.txt', 'r', encoding='utf-8') as file, open(input(), 'r', encoding='utf-8') as file2:
    f, l = [], []
    xx = []
    for line in file:
        f = (line.split())
    for line in file2:
        l.append(line)
    for i in l:
        for j in f:
            i = i.lower().replace(j, '*' * len(j))
        xx.append(i)
        
after = [[i for i in j] for j in xx]
before = [[i for i in j] for j in l]
a = ""

for i in range(len(after)):
    for j in range(len(after[i])):
        # print(i,j)
        if after[i][j] == '*':
            before[i][j] = '*'
        a += "".join(before[i][j])
print(a)
```