# 4.3 Вложенные списки. Часть 2

# Треугольник Паскаля 2

На вход программе подается натуральное число n. Напишите программу, которая выводит первые n строк треугольника Паскаля.

Формат входных данных

На вход программе подается число n (n≥1).

Формат выходных данных

Программа должна вывести первые nn строк треугольника Паскаля, каждую на отдельной строке в соответствии с образцом.

**Sample Input 1:**

```
4
```

**Sample Output 1:**

```
1
1 1
1 2 1
1 3 3 1
```

**Sample Input 2:**

```
5
```

**Sample Output 2:**

```
1
1 1
1 2 1
1 3 3 1
1 4 6 4 1
```

**Sample Input 3:**

```
2
```

**Sample Output 3:**

```
1
1 1
```

# Solution

```python
from math import factorial

n = int(input())
a = [1]
print(1)

for i in range(1, n):
    for j in range(0, i + 1):
        print(int(factorial(i) / (factorial(j) * factorial(i - j))), end=" ")
        a.append(int(factorial(i) / (factorial(j) * factorial(i - j))))
    print("\n", end="")
```