# 4.6 Матрицы. Часть 3

# Заполнение спиралью 😈😈

На вход программе подаются два натуральных числа n и m. Напишите программу, которая создает матрицу размером n×m
заполнив её "спиралью" в соответствии с образцом.

**Формат входных данных**

На вход программе на одной строке подаются два натуральных числа nn и mm — количество строк и столбцов в матрице.

**Формат выходных данных**

Программа должна вывести матрицу в соответствии образцом.

Примечание. Для вывода элементов матрицы как в примерах, отводите ровно 33 символа на каждый элемент. Для этого
используйте строковый метод ljust(). Можно обойтись и без ljust(), система примет и такое решение 😇

**Sample Input 1:**

```
4 5
```

**Sample Output 1:**

```
1  2  3  4  5
14 15 16 17 6
13 20 19 18 7
12 11 10 9  8
```

**Sample Input 2:**

```
1 6
```

**Sample Output 2:**

```
1  2  3  4  5  6
```

**Sample Input 3:**

```
3 3
```

**Sample Output 3:**

```
1  2  3
8  9  4
7  6  5
```

# Solution

```python
n, m = map(int, input().split())
a = [[0] * m for _ in range(n)]

i, j, d = 0, 0, 0
moves = ((0, 1,), (1, 0,), (0, -1,), (-1, 0,),)
for k in range(1, n * m + 1):
    a[i][j] = k
    for l in range(4):
        newD = (d + l) % 4
        di, dj = moves[newD]
        newI, newJ = i + di, j + dj
        if 0 <= newI < n and 0 <= newJ < m and a[newI][newJ] == 0:
            i, j, d = newI, newJ, newD
            break
for row in a:
    print(*row)
```