# 4.7 Операции над матрицами в математике

# Сложение матриц

Напишите программу для вычисления суммы двух матриц.

**Формат входных данных**

На вход программе подаются два натуральных числа n и m — количество строк и столбцов в матрицах, затем элементы первой
матрицы, затем пустая строка, далее следуют элементы второй матрицы.

**Формат выходных данных**

Программа должна вывести результирующую матрицу, разделяя элементы символом пробела.

**Sample Input 1:**

```
2 4
1 2 3 4
5 6 7 1

3 2 1 2
1 3 1 3
```

**Sample Output 1:**

```
4 4 4 6
6 9 8 4
```

**Sample Input 2:**

```
3 3
9 6 3
3 1 1
4 7 5

0 3 2
1 7 8
4 2 3
```

**Sample Output 2:**

```
9 9 5
4 8 9
8 9 8
```

**Sample Input 3:**

```
1 1
1

1
```

**Sample Output 3:**

```
2
```

# Solution

```python
n, m = map(int, input().split())
first = [list(map(int, input().split())) for i in range(n)]
input()
second = [list(map(int, input().split())) for i in range(n)]
[print(*[first[j][i] + second[j][i] for i in range(m)]) for j in range(n)]
```