# 4.7 Операции над матрицами в математике

# Умножение матриц 🌶️

Напишите программу, которая перемножает две матрицы.

**Формат входных данных**

На вход программе подаются два натуральных числа nn и mm — количество строк и столбцов в первой матрице, затем элементы
первой матрицы, затем пустая строка. Далее следуют числа mm и kk — количество строк и столбцов второй матрицы затем
элементы второй матрицы.

**Формат выходных данных**

Программа должна вывести результирующую матрицу, разделяя элементы символом пробела.

**Sample Input 1:**

```
2 2
1 2
3 2

2 2
3 2
1 1
```

**Sample Output 1:**

```
5 4
11 8
```

**Sample Input 2:**

```
3 2
2 5
6 7
1 8

2 3
1 2 1
0 1 0
```

**Sample Output 2:**

```
2 9 2
6 19 6
1 10 1
```

**Sample Input 3:**

```
3 3
2 4 6
1 3 5
0 4 8

3 3
6 3 1
9 6 3
0 2 0
```

**Sample Output 3:**

```
48 42 14
33 31 10
36 40 12
```

# Solution

```python
n, m = map(int, input().split())
first = [list(map(int, input().split())) for i in range(n)]
input()
n1, m1 = map(int, input().split())
second = [list(map(int, input().split())) for i in range(n1)]
third = []

rows_A, cols_A = n, m
rows_B, cols_B = n1, m1

c = [[0 for row in range(cols_B)] for col in range(rows_A)]

for i in range(rows_A):
    for j in range(cols_B):
        for k in range(cols_A):
            c[i][j] += first[i][k] * second[k][j]

for i in c:
    for j in i:
        print(j, end=" ")
    print()

```