# 5.1 Итоговая работа

# Латинский квадрат 🌶️

Латинским квадратом порядка nn называется квадратная матрица размером n \times nn×n, каждая строка и каждый столбец
которой содержат все числа от 11 до nn. Напишите программу, которая проверяет, является ли заданная квадратная матрица
латинским квадратом.

**Формат входных данных**

На вход программе подаётся натуральное число nn — количество строк и столбцов в матрице, затем элементы матрицы: nn
строк, по nn чисел в каждой, разделённые пробелами.

**Формат выходных данных**

Программа должна вывести слово YES, если матрица является латинским квадратом, и слово NO, если не является.

**Sample Input 1:**

```
4
2 3 4 1
3 4 1 2
4 1 2 3
1 2 3 4
```

**Sample Output 1:**

```
YES
```

**Sample Input 2:**

```
3
1 2 3
3 2 1
2 3 4
```

**Sample Output 2:**

```
NO
```

# Solution

```python
n = int(input())
a = [input().split() for i in range(n)]
x = list(zip(*a))
s = set(map(str, range(1, n + 1)))
flag, flag1 = False, False
for i in a:
    flag = set(i) == s
for i in x:
    flag1 = set(i) == s
print(["NO", "YES"][all([flag, flag1])])
```