# 5.1 Итоговая работа

# Ходы ферзя

На шахматной доске 8×8 стоит ферзь. Отметьте положение ферзя на доске и все клетки, которые бьет ферзь. Клетку, где
стоит ферзь, отметьте буквой Q, клетки, которые бьет ферзь, отметьте символами *, остальные клетки заполните точками.

**Формат входных данных**

На вход программе подаются координаты ферзя на шахматной доске в шахматной нотации (то есть в виде e4, где сначала
записывается номер столбца (буква от a до h, слева направо), затем номер строки (цифра от 1 до 8, снизу вверх)).

**Формат выходных данных**

Программа должна вывести на экран изображение доски, разделяя элементы пробелами.

**Sample Input 1:**

```
c4
```

**Sample Output 1:**

```
. . * . . . * .
. . * . . * . .
* . * . * . . .
. * * * . . . .
* * Q * * * * *
. * * * . . . .
* . * . * . . .
. . * . . * . .
```

**Sample Input 2:**

```
a1
```

**Sample Output 2:**

```
* . . . . . . *
* . . . . . * .
* . . . . * . .
* . . . * . . .
* . . * . . . .
* . * . . . . .
* * . . . . . .
Q * * * * * * *
```

**Sample Input 3:**

```
h5
```

**Sample Output 3:**

```
. . . . * . . *
. . . . . * . *
. . . . . . * *
* * * * * * * Q
. . . . . . * *
. . . . . * . *
. . . . * . . *
. . . * . . . *
```

# Solution

```python
coor = input()
slovarx = {'a': 0, 'b': 1, 'c': 2, 'd': 3, 'e': 4, 'f': 5, 'g': 6, 'h': 7}
slovary = {'8': 0, '7': 1, '6': 2, '5': 3, '4': 4, '3': 5, '2': 6, '1': 7, '0': 8}
y1 = slovarx.get(coor[0])
x1 = slovary.get(coor[1])
a = [['.'] * 8 for i in range(8)]
for i in range(8):
    for j in range(8):
        x2, y2 = i, j
        if abs(x1 - x2) == abs(y1 - y2) or x1 == x2 or y1 == y2:
            a[i][j] = "*"
a[x1][y1] = "Q"
for i in range(8):
    for j in range(8):
        print(a[i][j], end=" ")
    print()

```