# 9.2 Часть 2

# Онлайн-школа BEEGEEK 6 🌶️

Руководителю онлайн-школы BEEGEEK захотелось узнать, кто из его учеников присутствовал на всех уроках с начала учебного
года. Для каждого урока есть листок со списком присутствовавших учеников.

Напишите программу, определяющую фамилии учеников, которые присутствовали на всех уроках.

**Формат входных данных**

На вход программе в первой строке дается число m – количество уроков, проведенных с начала учебного года. Далее идёт m
блоков строк, описывающих листки с фамилиями. На первой строке каждого блока указано количество фамилий n_i, затем идёт
n_i строчек с фамилиями тех, кто был на уроке i-ом уроке.

**Формат выходных данных**

Программа должна вывести фамилии учеников, которые были на всех уроках, отсортированных в лексикографическом порядке.
Каждая фамилия должна быть записана на отдельной строке.

Примечание 1. Гарантируется, что среди учеников школы BEEGEEK нет однофамильцев.

Примечание 2. Гарантируется, что хотя бы один ученик был на всех уроках.

**Sample Input 1:**

```
2
4
Черкасов
Фокин
Самойлов
Устинов
2
Черкасов
Устинов
```

**Sample Output 1:**

```
Устинов
Черкасов
```

**Sample Input 2:**

```
1
5
Сахаров
Авдеев
Зверев
Селезнев
Нечаев
```

**Sample Output 2:**

```
Авдеев
Зверев
Нечаев
Сахаров
Селезнев
```

**Sample Input 3:**

```
3
3
Князев
Сафонов
Майоров
2
Князев
Майоров
1
Майоров
```

**Sample Output 3:**

```
Майоров
```

# Solution

```python
all = [[input() for j in range(int(input()))] for i in range(int(input()))]
x = set(all[0])
for i in all:
    x = x.intersection(set(i))
print(*sorted(x), sep="\n")

```