# 2.1.1 Соседние цифры

Напишите программу, которая определяет, содержит ли пятизначное число две одинаковые цифры, стоящие рядом.

**Формат входных данных**

На вход программе подается пятизначное натуральное число.

**Формат выходных данных**

Программа должна вывести YES, если число содержит две одинаковые цифры, стоящие рядом и NO в противном случае.

**Sample Input 1:**

```
83112
```

**Sample Output 1:**

```
YES
```

**Sample Input 2:**

```
99085
```

**Sample Output 2:**

```
YES
```

**Sample Input 3:**

```
23563
```

**Sample Output 3:**

```
NO
```

**Sample Input 4:**

```
12323
```

**Sample Output 4:**

```
NO
```

# Solution

```python
number = input()
res = []
for i in range(1, 5):
    if number[i] == number[i - 1]:
        res.append(1)
    else:
        res.append(0)

print(["NO", "YES"][any(res)])
```
