# 3.1.1 Допустимые номера телефонов

На вход программе подается натуральное число n, а затем n телефонных номеров, каждый на отдельной строке. Необходимо
вывести те номера, которые являются корректными.

Корректными номерами будут номера следующих двух форматов:

```
(xxx) xxx-xxxx
xxx-xxx-xxxx
где x – цифра от 00 до 99.
```

**Формат входных данных**
На вход программе подаются натуральное число n, а затем n строк, каждая на отдельной строке.

**Формат выходных данных**
Программа должна вывести на экран корректные номера телефонов или вывести строку «All phone numbers are incorrect», если
все номера, подающиеся на вход – некорректные.

**Sample Input 1:**

```
3
985-243-2767
334 159 7090
(321) 564-9090
```

**Sample Output 1:**

```
985-243-2767
(321) 564-9090
```

**Sample Input 2:**

```
2
(123)-788-3223
232-311-320
```

**Sample Output 2:**

```
All phone numbers are incorrect
```

**Sample Input 3:**

```
6
990-467-2549
8885-496 (4120)
(122) 342-3445
8 922-760-22-11
(777) 923 2320
(990) 220-4180
```

**Sample Output 3:**

```
990-467-2549
(122) 342-3445
(990) 220-4180
```

# Solution

```python
import re

n = int(input())
numbers = [input() for _ in range(n)]
numbs = '    '.join([i for i in numbers if (12 == len(i) or len(i) == 14)])
res = []
result = re.findall(r'(\d{3}-\d{3}-\d{4})|(\(\d{3}\) \d{3}-\d{4})', numbs)
[res.extend(j) for j in [i for i in result]]
if len(res) > 0:
    print(*list(filter(None, res)), sep="\n")
else:
    print('All phone numbers are incorrect')
```
