# 4.1.2 n-ое число Трибоначчи

Последовательность Трибоначчи:

`T0 = 0, T1 = 1, T2 = 1 и Tn+3 = Tn + Tn+1 + Tn+2 для n >= 0`

Напишите программу, которая вычисляет n-ое число последовательности Трибоначчи.

**Формат входных данных**

На вход программе подается целое число n.

**Формат выходных данных**

Программа должна вывести n-ое число последовательности Трибоначчи.

**Sample Input 1:**

```
4
```

**Sample Output 1:**

```
4
```

**Sample Input 2:**

```
3
```

**Sample Output 2:**

```
2
```

**Sample Input 3:**

```
6
```

**Sample Output 3:**

```
13
```

**Sample Input 4:**

```
0
```

**Sample Output 4:**

```
0
```

**Sample Input 5:**

```
25
```

**Sample Output 5:**

```
1389537
```

# Solution

```python
result = [0, 1, 1]

limit = int(input()) + 1

while 1:
    if len(result) >= limit:
        break
    new = sum(result[-3:])
    result.append(new)
if limit == 1:
    print(0)
else:
    print(result[-1])
```
