# 4.1.4 Максимальное Число

На вход программе подается положительное целое число n, состоящее только из цифр 6 и 9. Напишите программу, которая
возвращает максимальное число, которое вы можете получить, изменив не более одной цифры (6 заменяется на 9, а 9 на 6).

**Формат входных данных**

На вход программе подается целое число, состоящее из цифр 6 и 9.

**Формат выходных данных**

Программа должна вывести максимальное число, которое можно получить, если изменить не более одной цифры.

**Sample Input 1:**

```
6666
```

**Sample Output 1:**

```
9666
```

**Sample Input 2:**

```
9996
```

**Sample Output 2:**

```
9999
```

**Sample Input 3:**

```
9999
```

**Sample Output 3:**

```
9999
```

**Sample Input 4:**

```
6996
```

**Sample Output 4:**

```
9996
```

# Solution

```python
n = input()
max_num = int(n)
num = list(map(int, list(n)))
for i in range(len(num)):
    res = list(num)
    num[i] = 9
    x = ''.join(list(map(str, num)))
    if int(x) > max_num:
        max_num = int(x)
    num = res
    x = ''
print(max_num)
```
