# 4.1.7 Самый длинный палиндром

Дана строка, состоящая из строчных и прописных букв английского алфавита. Напишите программу, которая выводит длину
самого длинного палиндрома, который может быть составлен из букв этой строки.

**Формат входных данных**

На вход подается строка, которая состоит из строчных и прописных букв английского алфавита.

**Формат выходных данных**

Программа должна вывести число – длину самого длинного палиндрома, который может быть составлен из букв этой строки.

**Примечание 1.** Палиндром читается одинаково в обоих направлениях, например слово «довод».

**Примечание 2.** Считайте, что буквы чувствительны к регистру, то есть строка Aa не является палиндромом.

**Sample Input 1:**

```
mbccccpp
```

**Sample Output 1:**

```
7
```

**Sample Input 2:**

```
HelloWorld
```

**Sample Output 2:**

```
5
```

**Sample Input 3:**

```
uu
```

**Sample Output 3:**

```
2
```

**Sample Input 4:**

```
BbdoiID
```

**Sample Output 4:**

```
1
```

# Solution

```python
text = input()

temp = {}  # сколько раз встречается "тот или иной" символ
for char in text:
    if not char in temp:
        temp.update({char: 1})
    else:
        temp[char] += 1

# подсчет длины самого длинного палиндрома
result = 0
for key in temp:
    result += 2 * (temp[key] // 2)
if len(text) - result > 0:
    result += 1

print(result)
```
