# Only numbers

На вход программе подается неопределенное количество строк, каждая из которых содержит произвольное значение. Напишите
программу с использованием конструкции try-except, которая выводит сумму всех введенных чисел, а затем — количество
введенных нечисловых значений.

**Формат входных данных**

На вход программе подается неопределенное количество строк (хотя бы одна), каждая из которых содержит произвольное
значение.

**Формат выходных данных**

Программа должна вывести сумму всех введенных чисел (тип int и float), а затем на следующей строке — количество
введенных нечисловых значений.

**Примечание 1**. Если ни одно число введено не было, то сумма равна 0.

**Примечание 2**. Рассмотрим первый тест. Имеем три введенных числа, сумма которых равна:

```python
100 + 10 + 1.1 = 111.1
```

Также три нечисловых значения, а именно: i'm number!, [1, 99], {'math', 'physics'}.

**Sample Input 1:**

```python
100
i'm number!
10
[1, 99]
1.1
{'math', 'physics'}
```

**Sample Output 1:**

```python
111.1
3
```

**Sample Input 2:**

```python
10
10
```

**Sample Output 2:**

```python
20
0
```

**Sample Input 3:**

```python
abc
cda
xyz
```

**Sample Output 3:**

```python
0
3
```

# Solution

```python
import sys

summ, words = 0, 0
for string in map(str.strip, sys.stdin):
    try:
        summ += float(string) if int(float(string)) != float(string) else int(string)
    except:
        words += 1
print(summ)
print(words)
```