# Взлом врат

Безумный ученый изобрел машину времени, подключив микроволновку к телефону, и с помощью этого телефона отправляет письма
в прошлое. Однако она получилась настолько ужасной, что мало того что в отправленном сообщении могут перемешиваться
символы, так еще и добавляется один лишний. Но, если вы найдете этот символ, быть может, неисправность будет обнаружена?

Напишите программу, которая находит лишний символ в измененном сообщении.

**Формат входных данных**

На вход программе подаются две строки – исходная и измененная, в которой добавлен один лишний символ. Длины строк не
превышают 45000 символов.

**Формат выходных данных**

Программа должна найти лишний символ во второй строке и вывести его.

Примечание. Посмотреть все тесты к задаче можно по ссылке.

**Sample Input 1:**

```python
tuturu
tuturuu
```

**Sample Output 1:**

```python
u
```

**Sample Input 2:**

```python
スーパーハカー
スーパーハッカー
```

**Sample Output 2:**

```python
ッ
```

**Sample Input 3:**

```python
😁😂😃😄😅😆😇😈😉😊😋😌😍😎
😁😉😂😃😄😇😅😆😈😊😋😌😍✨😎
```

**Sample Output 3:**

```python
✨
```

# Solution

```python
a, b = input(), input()
for i in a:
    b = b.replace(i, '', 1)
print(b)
```