# Славный город

Багдадский вор перемещается по городу размера N×N, перебегая по соседним справа или снизу клеткам. Добраться до каждой
из клеток вор может за какое-то количество секунд (от 1 до 9), а также на клетке может стоять стражник, в таком случае
клетка будет обозначаться числом 0, и вор не сможет пройти через нее. Ему нужно добраться из самой левой верхней точки (
1; 1) в самую нижнюю правую точку (N; N).

Напишите программу, которая рисует маршрут, по которому вор сумеет пройти весь путь за кратчайшее время. Если такого
пути нет, требуется вывести слово Impossible.

**Формат входных данных**

В первой строке на вход программе подается натуральное число N, в последующих N строках подаются строки длины N,
состоящие из чисел от 0 до 9 включительно.

**Формат выходных данных**

Программа должна нарисовать маршрут кратчайшего пути из N строк длины N, где символ # будет означать клетки, по которым
вор должен пройти, а символ - – остальные. Если такого пути нет, следует вывести слово Impossible.

**Примечание 1**. Гарантируется, что кратчайший путь единственный, если таковой имеется.

**Примечание 2.** Обратите внимание на то, что стражник может стоять как в клетке (1; 1), так и в клетке (N; N). В этом
случае следует вывести слово Impossible.

**Примечание 3.** Посмотреть все тесты к задаче можно по ссылке.

**Sample Input 1:**

```
3
230
001
012
```

**Sample Output 1:**

```
Impossible
```

**Sample Input 2:**

```
4
1112
1001
1101
0111
```

**Sample Output 2:**

```
#---
#---
##--
-###
```

**Sample Input 3:**

```
7
1234567
3010001
5022901
7023201
9022201
7000101
5311111
```

**Sample Output 3:**

```
###----
--#----
--#----
--#----
--###--
----#--
----###
```

# Solution

```python
N = int(input())

field = [list(input()) for i in range(N)]
from bisect import insort
import time
res = []


def checkio(land):
    m, n, visited = len(land), len(land[0]), set()
    bag = [(int(start), 0, i, start, [(0, 0)]) for i, start in enumerate(land[0][0])]

    while bag:
        for i, v in enumerate(bag):
            if v[3].startswith('0'):
                bag.pop(i)
        if not bag[0][3].startswith('0'):
            res.append(bag[0][1:3])
        if (N - 1, N - 1) in bag[0][-1]:
            return 0, bag
        digged, x, y, summ, points = bag.pop(0)
        visited.add((x, y))
        if y == m - 1 and x == m - 1:
            return digged, bag
        for i, j in [(1, 0), (0, 1)]:
            xn, yn = x + i, y + j
            if not (0 <= xn < m and 0 <= yn < n) or (xn, yn) in visited:
                continue
            if land[xn][yn] == '0':
                continue
            insort(bag, (digged + int(land[xn][yn]), xn, yn, summ + land[xn][yn], points + [(xn, yn)]))


try:
    dagged, area_full = checkio(field)
    area = area_full[0][-1]
    for i in range(N):
        for j in range(N):
            if (i, j) in area:
                field[i][j] = '#'
            else:
                field[i][j] = '-'
    for i in field:
        print(''.join(i))
except:
    print('Impossible')

```