# Последовательность чисел

Напишите программу, которая выводит nn первых элементов последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 ... (число
повторяется столько раз, чему оно равно).

**Формат входных данных**
На вход программе подается положительное целое число n (n≤200000).

**Формат выходных данных**
Программа должна вывести указанную последовательность чисел, разделённых пробелом.

Примечание. Посмотреть все тесты к задаче можно по ссылке.

**Sample Input 1:**

```
7
```

**Sample Output 1:**

```
1 2 2 3 3 3 4
```

**Sample Input 2:**

```
1
```

**Sample Output 2:**

```
1
```

**Sample Input 3:**

```
10
```

**Sample Output 3:**

```
1 2 2 3 3 3 4 4 4 4
```

**Sample Input 4:**

```
17
```

**Sample Output 4:**

```
1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 6 6
```

**Sample Input 5:**

```
100
```

**Sample Output 5:**

```
1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 6 6 6 6 6 6 7 7 7 7 7 7 7 8 8 8 8 8 8 8 8 9 9 9 9 9 9 9 9 9 10 10 10 10 10 10 10 10 10 10 11 11 11 11 11 11 11 11 11 11 11 12 12 12 12 12 12 12 12 12 12 12 12 13 13 13 13 13 13 13 13 13 13 13 13 13 14 14 14 14 14 14 14 14 14
```

# Solution

```python
num = int(input())
cnt = 0
res = []
while len(res) < num:
    res += [cnt] * cnt
    cnt += 1
print(*res[:num])
```