# Умножение строк

Назовем умножением строки на число запись в формате n(string), где n — неотрицательное целое число, а string — строка,
которая должна быть записана n раз. Раскрытием умножения будем считать развернутый вариант данной записи, например,
строка ti2(Be)3(Ge) после раскрытия в ней всех умножений будет иметь вид tiBeBeGeGeGe.

Напишите программу, которая раскрывает все умножения в тексте и выводит полученный результат.

**Формат входных данных**
На вход программе подается одна строка, содержащая строчные латинские буквы, числа и скобки.

**Формат выходных данных**
Программа должна вывести строку, в которой раскрыты все умножения с учетом приоритетности операций.

**Примечание 1.** Гарантируется, что умножение в подаваемой строке всегда записано корректно, то есть строго в формате
n(string). Записи вида 4(2), 3q, (fg)7 не корректны.

**Примечание 2.** Рассмотрим третий тест. С учетом приоритетности операций сначала раскрываем умножение 2(a) и получаем
промежуточную строку bbbb10(aa)bbb, далее раскрываем умножение 10(aa) и получаем конечный результат в виде строки
bbbbaaaaaaaaaaaaaaaaaaaabbb.

**Примечание 3.** Строка, в которой раскрыты все умножения, всегда содержит исключительно строчные латинские буквы.

**Примечание 4.** Максимальная длина результирующей строки не превосходит 450000 символов.

**Примечание 5.** Тестовые данные доступны по ссылке.

**Sample Input 1**:

```python
hello3(world)
hi
```

**Sample Output 1:**

```python
helloworldworldworldhi
```

**Sample Input 2:**

```python
0(s)
he0(be)
lie0(ve)
d
```

**Sample Output 2:**

```python
helied
```

**Sample Input 3:**

```python
bbbb10(2(a))
bbb
```

**Sample Output 3:**

```python
bbbbaaaaaaaaaaaaaaaaaaaabbb
```

**Sample Input 4:**

```python
hi2(priv3(d3(i)
dd)qq)b0(pr)
qwqdd
```

**Sample Output 4:**

```python
hiprivdiiidddiiidddiiiddqqprivdiiidddiiidddiiiddqqbqwqdd
```

**Sample Input 5:**

```python
hhhhhh
```

**Sample Output 5:**

```python
hhhhhh
```

# Solution

```python
st = input()


def func(st):
    list_st = list(st)

    for k, v in enumerate(list_st[::-1]):
        if k != len(st) - 1 and v.isnumeric() and not list_st[::-1][k + 1].isdigit():
            list_st[~k] = '|' + v
        if v == ')':
            list_st[~k] = v + '|'

    arr = ''.join(list_st).split('|')

    for k, v in enumerate(arr):
        if '(' in v and ')' in v:
            arr[k] = eval(v.replace('(', '*"').replace(')', '"'))

    resss = ''.join(arr)

    if '(' in resss:
        func(resss)
    else:
        print(''.join(resss))


func(st)
```

# Other Solution

```python
import re

string = input()
pattern = r'(\d+)\((\w+)\)'

while '(' in string:
    string = re.sub(pattern, lambda x: x.group(2) * int(x.group(1)), string)
print(string)
```