# Самое скучное условие

Зачастую из-за непонятных условий сложно понять суть задачи, поэтому иногда лучше написать коротко и по делу.

Напишите программу, которая находит длину самого длинного палиндрома, который можно составить из букв в строке.

**Формат входных данных**

На вход программе подается одна строка, состоящая из строчных латинских букв.

**Формат выходных данных**

Программа должна вывести одно число — длину самого длинного палиндрома, который можно составить из букв в введенной
строке.

**Примечание 1.** Палиндром читается одинаково в обоих направлениях, например, слово «rotavator».

**Примечание 2.** Рассмотрим первый тест. Из букв `a, b, a, b, q, t, и d` можно составить палиндром, например, abqba,
длина которого равна 55. Палиндром большей длины из данных букв составить нельзя.

**Примечание 3.** Тестовые данные доступны по ссылке.

**Sample Input 1:**

```python
ababqtd
```

**Sample Output 1:**

```python
5
```

**Sample Input 2:**

```python
bebebe
```

**Sample Output 2:**

```python
5
```

**Sample Input 3:**

```python
qaaaaaaaab
```

**Sample Output 3:**

```python
9
```

# Solution

```python
from collections import Counter

a = input()
counter = Counter(a)
letters = list(filter(lambda y: y[1] > 1, counter.items()))
letters2 = list(map(lambda x: (x[0], x[1]) if x[1] % 2 == 0 else (x[0], x[1] - 1), letters))
summ = sum(i[1] for i in letters2)
result = summ + [0, 1][len(a) > summ]
print(result)
```