# Повторяйповторяйповторяй

Напишите программу, которая определяет, на какое максимальное количество одинаковых подстрок можно разбить данную строку
так, чтобы все элементы строки были задействованы.

**Формат входных данных**

На вход программе подается одна строка, состоящая из строчных латинских букв., длина которой не превышает 400000
символов.

**Формат выходных данных**

Программа должна вывести одно натуральное число — максимальное количество подстрок в разбиении из условия.

**Примечание 1.** Рассмотрим первый тест. Строку `abcabcabc` можно разбить на 3 одинаковые подстроки: `abc, abc и abc`.

**Примечание 2.** Рассмотрим шестой тест. Строку `bebebeb` можно разбить на единственную подстроку `bebebeb`,
соответствующую исходной. Разбиение на подстроки, например, `be` или `beb` невозможно, так как в любом случае остаются
незадействованные элементы строки.

**Примечание 3.** Тестовые данные доступны по ссылке.

**Sample Input 1:**

```python
abcabcabc
```

**Sample Output 1:**

```python
3
```

**Sample Input 2:**

```python
acdc
```

**Sample Output 2:**

```python
1
```

**Sample Input 3:**

```python
bbbbbb
```

**Sample Output 3:**

```python
6
```

**Sample Input 4:**

```python
abobaboabobabo
```

**Sample Output 4:**

```python
2
```

**Sample Input 5:**

```python
abobaboaaabobaboaa
```

**Sample Output 5:**

```python
2
```

**Sample Input 6:**

```python
bebebeb
```

**Sample Output 6:**

```python
1
```

# Solution

```python
st = input()
for i in range(1, len(st) + 1):
    if st[:i] * (len(st[i:]) // len(st[:i])) == st[i:]:
        print(len(st) // i)
        break
    elif st[i:].count(st[:i] * 2) > 2:
        print(1)
        break
```