# Одиндватри

Рассмотрим последовательность натуральных чисел:

```python
1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14,…
```

Перевернем в ней каждое число. Получим последовательность:

```python
1, 2, 3, 4, 5, 6, 7, 8, 9, 01, 11, 21, 31, 41,…
```

Запишем полученную последовательность слитно в виде одной строки:

```python
1234567890111213141...
```

Напишите программу, которая выводит n-ую цифру полученной строки.

**Формат входных данных**
На вход программе подается натуральное число nn, где 1⩽n⩽10^50

**Формат выходных данных**
Программа должна вывести n-ую цифру строки, представленной в условии задачи.

**Примечание**. Тестовые данные доступны по ссылке.

**Sample Input 1:**

```python
10
```

**Sample Output 1:**

```python
0
```

**Sample Input 2:**

```python
1
```

**Sample Output 2:**

```python
1
```

**Sample Input 3:**

```python
100
```

**Sample Output 3:**

```python
5
```

# Solution

```python

number = int(input())
n = 0
while number > (9 * (n + 1) * 10 ** n - 10 ** (n + 1) + 1) // 9:
    tmp2 = (9 * (n + 2) * 10 ** (n + 1) - 10 ** (n + 2) + 1) // 9
    n += 1
res = 10 ** n - 1 - ((tmp2 - number) // n)
res_number = (tmp2 - number) % n
print(str(res)[res_number])
```