# Скобки

Напишите программу, которая выводит все правильные скобочные выражения заданной длины, состоящие из круглых и квадратных
скобок.

**Формат входных данных**

На вход программе подается натуральное четное число n, где 2≤n≤12.

**Формат выходных данных**

Программа должна вывести все правильные скобочные выражения длины n, состоящие из круглых и квадратных скобок, каждое на
отдельной строке.

**Примечание 1.** Выводить скобочные выражения можно в любом порядке.

**Примечание 2.** Тестовые данные доступны по ссылке.

**Sample Input 1:**

```
2
```

**Sample Output 1:**

```
()
[]
```

**Sample Input 2:**

```
4
```

**Sample Output 2:**

```
(())
[[]]
[()]
()[]
[]()
()()
([])
[][]
```

# Solution

```python
stack = []
opened, closed = "([", ")]"
char_number = int(input())
result = [' ' for i in range(char_number)]


def generation_brackets(pos, open_brackets_amount):
    if pos == char_number:
        print(''.join(result))
        return

    if char_number - 1 - pos > open_brackets_amount:
        idx = 0
        while idx < len(opened):
            result[pos] = opened[idx]
            stack.append(opened[idx])
            generation_brackets(pos + 1, open_brackets_amount + 1)
            stack.pop()
            idx += 1

    if stack:
        cur_open = stack[-1]
        result[pos] = closed[opened.find(cur_open)]
        stack.pop()
        generation_brackets(pos + 1, open_brackets_amount - 1)
        stack.append(cur_open)


generation_brackets(0, 0)

```