# Lines

В таблице n×n некоторые клетки заняты шариками, другие свободны. Выбран шарик, который нужно переместить, и место, куда
его нужно переместить. Выбранный шарик за один шаг перемещается в соседнюю по горизонтали или вертикали свободную
клетку.

Напишите программу, которая определяет, возможно ли переместить шарик из изначальной клетки в заданную, и если возможно,
то находит путь из наименьшего количества шагов.

**Формат входных данных**
На вход программе в первой строке подается число nn, где 2≤n≤40, далее следуют n строк длины n, представляющие собой
таблицу. Точкой `.` обозначается свободная клетка, латинской заглавной `O` — шарик, собачкой `@` — исходное положение
шарика, который должен двигаться, латинской заглавной `X` — конечное положение шарика.

**Формат выходных данных**
Программа должна вывести `YES`, если движение возможно, или `NO`, если нет. Если движение возможно, следует также
вывести исходную таблицу n×n, обозначив на ней путь плюсами `+`.

**Примечание 1.** Если движение шарика возможно, конечная точка `Х` также должна быть обозначена плюсом `+`.

**Примечание 2.** Если вариантов добраться до конечной точки несколько, можно вывести любой.

**Примечание 3.** Тестовые данные доступны по ссылке.

**Sample Input 1:**

5
....X
.OOOO
.....
OOOO.
@....
**Sample Output 1:**

YES
+++++
+OOOO
+++++
OOOO+
@++++
**Sample Input 2:**

5
..X..
.....
OOOOO
.....
..@..
**Sample Output 2:**

NO
**Sample Input 3:**

5
...X.
.....
O.OOO
.....
....@
**Sample Output 3:**

YES
..++.
.++..
O+OOO
.++++
....@

# Solution

```python
MAX_INT = 2000000
FREE = 2000001
START = 0
FINISH = 2000003
WALL = 2000004
q = []

def main():
    n = int(input())
    a = [[0]*(n+2) for _ in range(n + 2)]
    ss = [[0]*n for _ in range(n)]
    for i in range(n):
        ss[i] = list(input())
        for j in range(n):
            if ss[i][j] == '.':
                a[i + 1][j + 1] = FREE
            elif ss[i][j] == 'X':
                a[i + 1][j + 1] = FINISH
                start = (i, j)
            elif ss[i][j] == 'O':
                a[i + 1][j + 1] = WALL
            else:
                a[i + 1][j + 1] = START
                startX = i + 1
                startY = j + 1

    q.append((startX, startY))
    fin = False
    while len(q) > 0:
        startX, startY = q.pop(0)
        if a[startX-1][startY] == FINISH:
            fin = True
            a[startX - 1][startY] = a[startX][startY] + 1
            startX -= 1
            break
        elif a[startX + 1][startY] == FINISH:
            fin = True
            a[startX + 1][startY] = a[startX][startY] + 1
            startX += 1
            break

        elif a[startX][startY - 1] == FINISH:
            fin = True
            a[startX][startY - 1] = a[startX][startY] + 1
            startY -= 1
            break

        elif a[startX][startY + 1] == FINISH:
            fin = True
            a[startX][startY + 1] = a[startX][startY] + 1
            startY += 1
            break
        if a[startX - 1][startY] == FREE:
            q.append((startX - 1, startY))
            a[startX - 1][startY] = a[startX][startY] + 1
            
        if a[startX + 1][startY] == FREE:
            q.append((startX + 1, startY))
            a[startX + 1][startY] = a[startX][startY] + 1
        
        if a[startX][startY - 1] == FREE:
            q.append((startX, startY - 1))
            a[startX][startY-1] = a[startX][startY] + 1
        
        if a[startX][startY + 1] == FREE:
            q.append((startX, startY + 1))
            a[startX][startY+1] = a[startX][startY] + 1
    if not fin:
        print('NO')
    else:
        while a[startX][startY] > 1 :
            if a[startX][startY] == a[startX - 1][startY] + 1:
                ss[startX - 2][startY - 1] = '+'
                startX-=1
    
            elif a[startX][startY] == a[startX + 1][startY] + 1:
                ss[startX][startY - 1] = '+'
                startX+=1
    
            elif a[startX][startY] == a[startX][startY-1] + 1:
                ss[startX-1][startY - 2] = '+'
                startY-=1
    
            elif a[startX][startY] == a[startX][startY+1] + 1:
                ss[startX-1][startY] = '+'
                startY+=1
    
    
        print('YES')
        ss[start[0]][start[1]] = '+'
        for i in range(n):
            print(*ss[i], sep='')


main()
```