# Отсортированные даты

Напишите программу, которая принимает на вход последовательность дат и выводит их в порядке неубывания.

**Формат входных данных**

На вход программе подается натуральное число nn, а затем nn корректных дат в ISO формате (YYYY-MM-DD), каждая на
отдельной строке.

**Формат выходных данных**

Программа должна вывести введенные даты в порядке неубывания, каждую на отдельной строке, в формате DD/MM/YYYY.

**Примечание 1.** Последовательность называется неубывающей, если каждый ее следующий член не меньше предыдущего,
например:

```python
1, 1, 2, 3, 4, 4, 4, 5, 6, ...
```

Обратите внимание, что такая последовательность не является возрастающей.

**Примечание 2.** Считайте, что при форматировании даты с помощью %Y год выводится без ведущих нулей, так как на
серверах Stepik установлен Linux.

**Sample Input 1:**

```python
5
2021 - 0
8 - 01
2021 - 0
8 - 02
2021 - 07 - 01
2021 - 06 - 01
2021 - 05 - 01
```

**Sample Output 1:**

```python
01 / 05 / 2021
01 / 06 / 2021
01 / 07 / 2021
01 / 0
8 / 2021
02 / 0
8 / 2021
```

**Sample Input 2:**

```python
3
2021 - 11 - 01
2021 - 11 - 01
2021 - 11 - 01
```

**Sample Output 2:**

```python
01 / 11 / 2021
01 / 11 / 2021
01 / 11 / 2021
```

# Solution

```python
from datetime import date

dates = sorted(date.fromisoformat(input()) for _ in range(int(input())))
dates_format = map(lambda dt: dt.strftime('%d/%m/%Y'), dates)
print(*dates_format, sep='\n')
```