# Сотрудники организации 🙂

Дан список сотрудников организации, в котором указаны их фамилии, имена и даты рождения. Напишите программу, которая
определяет, в какую из дат родилось больше всего сотрудников.

**Формат входных данных**

На вход программе в первой строке подается натуральное число nn — количество сотрудников, работающих в организации. В
последующих nn строках вводятся данные о каждом сотруднике: имя, фамилия и дата рождения, разделённые пробелом. Дата
рождения указывается в формате DD.MM.YYYY.

**Формат выходных данных**

Программа должна вывести дату, в которую наибольшее количество сотрудников отмечает день рождения, в формате DD.MM.YYYY.
Если таких дат несколько, программа должна вывести их все в порядке возрастания, каждую на отдельной строке, в том же
формате.

**Sample Input 1:**

```python
5
Иван Петров 01.05.1995
Петр Сергеев 29.04.1995
Сергей Романов 01.01.1996
Роман Григорьев 01.01.1996
Григорий Иванов 01.05.1995
```

**Sample Output 1:**

```python
01.05.1995
01.01.1996
```

**Sample Input 2:**

```python
5
Иван Петров 14.10.1995
Петр Сергеев 29.04.1992
Сергей Романов 01.01.1994
Роман Григорьев 01.01.1994
Григорий Иванов 16.07.1995
```

**Sample Output 2:**

```python
01.01.1994
```

# Solution

```python
from datetime import datetime

def function(n):
    d = {}
    for _ in range(n):
        date_of_birth = datetime.strptime(input().split()[-1], '%d.%m.%Y')
        d[date_of_birth] = d.get(date_of_birth, 0) + 1

    date = filter(lambda key: max(d.values()) == d[key], d.keys())
    date = [dt.strftime('%d.%m.%Y') for dt in sorted(date)]
    print(*date, sep='\n')

function(int(input()))
```