# Самое понятное условие

Даны две даты — левая и правая границы диапазона соответственно. Напишите программу, которая из этого диапазона, включая
границы, выводит, начиная с даты, у которой сумма дня и месяца нечетная, каждую третью дату, только если она не
понедельник и не четверг.

**Формат входных данных**

На вход программе подаются две даты в формате DD.MM.YYYY — левая и правая границы диапазона соответственно, каждая на
отдельной строке. Гарантируется, что первая дата не больше второй.

**Формат выходных данных**

Программа должна из указанного диапазона, включая концы, вывести, начиная с даты, у которой сумма дня и месяца нечетная,
каждую третью дату, только если она не понедельник и не четверг. Даты должны быть расположены каждая на отдельной
строке, в формате DD.MM.YYYY.

**Примечание 1.** Если дат, удовлетворяющих условию, нет, программа ничего не должна выводить.

**Примечание 2.** Рассмотрим второй тест. Левая граница диапазона 07.03.2021 не является начальной датой, так как имеет
четную сумму дня и месяца, поэтому в качестве начальной берем следующую дату 08.03.2021. Дата 08.03.2021 не выводится,
так как является понедельником, поэтому двигаемся к следующей дате с шагом три: 11.03.2021. Дата 11.03.2021 не
выводится, так как является четвергом.

**Sample Input 1:**

```python
01.11
.2021
10.11
.2021
```

**Sample Output 1:**

```python
02.11
.2021
05.11
.2021
```

**Sample Input 2:**

```python
07.03
.2021
13.03
.2021
```

**Sample Output 2:**

**Sample Input 3:**

```python
06.11
.2021
27.11
.2021
```

**Sample Output 3:**

```python
06.11
.2021
09.11
.2021
12.11
.2021
21.11
.2021
24.11
.2021
27.11
.2021
```

# Solution

```python
from datetime import datetime, timedelta
def function(start, end):
    start, end = datetime.strptime(start, '%d.%m.%Y'), datetime.strptime(end, '%d.%m.%Y')
    while (start.day + start.month) % 2 != 1:
        start += timedelta(days=1)
    total_days = (end - start).days

    for day in range(0, total_days + 1, 3):
        next_day = start + timedelta(days=day)
        if next_day.weekday() not in [3, 0]:
            print(next_day.strftime('%d.%m.%Y'))

function(input(), input())
```