# Сотрудники организации 😄

Дан список сотрудников организации, в котором указаны их фамилии, имена и даты рождения. Напишите программу, которая
определяет самого старшего сотрудника из данного списка.

**Формат входных данных**

На вход программе в первой строке подается натуральное число nn — количество сотрудников, работающих в организации. В
последующих nn строках вводятся данные о каждом сотруднике: имя, фамилия и дата рождения, разделённые пробелом. Дата
рождения указывается в формате DD.MM.YYYY.

**Формат выходных данных**

Программа должна определить самого старшего сотрудника и вывести его дату рождения, имя и фамилию, разделив пробелом.
Если таких сотрудников несколько, программа должна вывести их дату рождения, а также их количество, разделив пробелом.

**Примечание 1**. Гарантируется, что у всех сотрудников имена и фамилии различны.

**Sample Input 1:**

```python
3
Иван Петров 01.05.1995
Петр Сергеев 29.04.1995
Сергей Иванов 01.01.1996
```

**Sample Output 1:**

```python
29.04.1995 Петр Сергеев
```

**Sample Input 2:**

```python
3
Иван Петров 01.05.1995
Петр Сергеев 29.05.1995
Сергей Иванов 01.05.1995
```

**Sample Output 2:**

```python
01.05.1995 2
```

# Solution

```python
from datetime import datetime


def function(n):
    d = {}
    for _ in range(n):
        name, surname, date_of_birth = input().split()
        date_of_birth = datetime.strptime(date_of_birth, '%d.%m.%Y')
        d.setdefault(date_of_birth, [])
        d[date_of_birth].append(name + ' ' + surname)
    date, names = min(d.keys()).strftime('%d.%m.%Y'), d[min(d)]
    print(date + ' ' + names[0] if len(names) == 1 else date + ' ' + str(len(names)))


function(int(input()))
```