# FAKE NEWS 🌶️

Команда BEEGEEK планирует выпустить свой новый курс 08.11.2022 ровно в 12:00. Напишите программу, которая принимает на
вход текущие дату и время и определяет, сколько времени осталось до выхода курса.

**Формат входных данных**

На вход программе подаются текущие дата и время в формате DD.MM.YYYY HH:MM.

**Формат выходных данных**

Программа должна вывести текст с указанием количества дней и часов, оставшихся до выхода курса, в следующем формате:

```python
До
выхода
курса
осталось: < кол - во
дней > дней
и < кол - во
часов > часов
```

Если в данном случае количество часов равно нулю, то вывести нужно только дни.

Если количество дней равно нулю, то вывести нужно только часы и минуты в следующем формате:

```python
До
выхода
курса
осталось: < кол - во
часов > часов
и < кол - во
минут > минут
```

Если в данном случае количество минут равно нулю, то вывести нужно только часы. Аналогично, если количество часов равно
нулю, то вывести нужно только минуты.

Если введенные дата и время больше либо равны 08.11.2022 12:00, программа должна вывести текст:

```python
Курс
уже
вышел!
```

**Примечание 1.** Программа должна подбирать правильную форму для существительных «день» и «минута». Для этого можете
смело взять свою функцию choose_plural() из этой задачи.

**Sample Input 1:**

```python
16.11
.2021
06: 30
```

**Sample Output 1:**

```python
До
выхода
курса
осталось: 357
дней
и
5
часов
```

**Sample Input 2:**

```python
6.11
.2022
12: 00
```

**Sample Output 2:**

```python
До
выхода
курса
осталось: 2
дня
```

**Sample Input 3:**

```python
08.11
.2022
10: 30
```

**Sample Output 3:**

```python
До
выхода
курса
осталось: 1
час
и
30
минут
```

**Sample Input 4:**

```python
08.11
.2022
0
9: 00
```

**Sample Output 4:**

```python
До
выхода
курса
осталось: 3
часа
```

**Sample Input 5:**

```python
08.11
.2022
11: 40
```

**Sample Output 5:**

```python
До
выхода
курса
осталось: 20
минут
```

**Sample Input 6:**

```python
08.11
.2022
12: 15
```

**Sample Output 6:**

```python
Курс
уже
вышел!
```

# Solution

```python
from datetime import datetime


def choose_plural(amount, declensions):
    if str(amount).endswith('1') and not str(amount).endswith('11'):
        return f'{amount} {declensions[0]}' if amount else ''
    elif str(amount).endswith(('2', '3', '4')) and not str(amount).endswith(('12', '13', '14')):
        return f'{amount} {declensions[1]}' if amount else ''
    else:
        return f'{amount} {declensions[2]}' if amount else ''


def function(dt):
    dt = datetime.strptime(dt, '%d.%m.%Y %H:%M')
    course = datetime.strptime('08.11.2022 12:00', '%d.%m.%Y %H:%M')
    td = course - dt
    days, hours, minutes = td.days, td.seconds // 3600, td.seconds % 3600 // 60
    d, h, m = ['день', 'дня', 'дней'], ["час", "часа", "часов"], ['минута', 'минуты', 'минут']
    pl_days, pl_hours, pl_minutes = choose_plural(days, d), choose_plural(hours, h), choose_plural(minutes, m)
    if days > 0:
        print(f'До выхода курса осталось: {pl_days}{" и " if days and hours else ""}{pl_hours}')
    elif not days and (hours or minutes):
        print(f'До выхода курса осталось: {pl_hours}{" и " if hours and minutes else ""}{pl_minutes}')
    else:
        print('Курс уже вышел!')


function(input())
```