# Сотрудники организации 😔

Дан список сотрудников организации, в котором указаны их фамилии, имена и даты рождения. Напишите программу, которая
определяет самого молодого сотрудника, празднующего свой день рождения в течение ближайших семи дней от текущей даты.

**Формат входных данных**

На вход программе в первой строке подается текущая дата в формате DD.MM.YYYY, в следующей строке вводится натуральное
число nn — количество сотрудников, работающих в организации. В последующих nn строках вводятся данные о каждом
сотруднике: имя, фамилия и дата рождения, разделённые пробелом. Дата рождения указывается в формате DD.MM.YYYY.

**Формат выходных данных**

Программа должна определить самого молодого сотрудника, празднующего свой день рождения в течение ближайших семи дней, и
вывести его имя и фамилию, разделив пробелом. Если таких сотрудников нет, программа должна вывести текст:

```
Дни рождения не планируются
```

**Примечание 1.** Гарантируется, что у всех сотрудников даты рождения различны.

**Примечание 2.** Например, для даты 01.11.2021 ближайшими семью днями являются:

```python
02.11.2021, 03.11.2021, 04.11.2021, 05.11.2021, 06.11.2021, 07.11.2021, 08.11.2021
```

**Sample Input 1:**

```python
14.11.2021
3
Иван Петров 16.11.1995
Петр Сергеев 14.11.1997
Сергей Романов 17.11.1994
```

**Sample Output 1:**

```python
Иван Петров
```

**Sample Input 2:**

```python
14.11.2021
3
Иван Петров 25.12.1995
Петр Сергеев 24.11.1997
Сергей Романов 28.12.1994
```

**Sample Output 2:**

```python
Дни рождения не планируются
```

# Solution

```python
from datetime import datetime, timedelta

def function(today, n):
    today = datetime.strptime(today, '%d.%m.%Y')
    days_next_week = [(today + timedelta(days=i)).replace(year=today.year) for i in range(1, 8)]
    d, dates = {}, []

    for _ in range(n):
        *name, date_of_birth = input().split()
        date_of_birth = datetime.strptime(date_of_birth, '%d.%m.%Y')
        name = ' '.join(name)
        dates.append((name, date_of_birth))

    birthday_next_week = [people for people in dates if people[1].replace(year=today.year) in days_next_week]
    sorted_days = sorted(birthday_next_week, key=lambda x: x[1]) or [['Дни рождения не планируются']]
    print(sorted_days[-1][0])

function(input(), int(input()))
```