# ТЧМ

Во многих музеях существует один день месяца, когда посещение музея для всех лиц или отдельных категорий граждан
происходит без взимания платы. Например, в Эрмитаже это третий четверг месяца.

Напишите программу, которая определяет даты бесплатных дней посещения Эрмитажа в заданном году.

**Формат входных данных**

На вход программе подается натуральное число, представляющее год.

**Формат выходных данных**
Программа должна определить все даты бесплатных дней посещения Эрмитажа в введенном году и вывести их. Даты должны быть
расположены в порядке возрастания, каждая на отдельной строке, в формате DD.MM.YYYY.

**Sample Input 1:**

```python
2021
```

**Sample Output 1:**

```python
21.01
.2021
18.02
.2021
18.03
.2021
15.04
.2021
20.05
.2021
17.06
.2021
15.07
.2021
19.08
.2021
16.09
.2021
21.10
.2021
18.11
.2021
16.12
.2021
```

**Sample Input 2:**

```python
2020
```

**Sample Output 2:**

```python
16.01
.2020
20.02
.2020
19.03
.2020
16.04
.2020
21.05
.2020
18.06
.2020
16.07
.2020
20.08
.2020
17.09
.2020
15.10
.2020
19.11
.2020
17.12
.2020
```

# Solution

```python
import calendar
from datetime import date


def get_free_days(year):
    mondays = []
    year_ = [calendar.monthcalendar(year, m) for m in range(1, 13)]
    for m_idx, month in enumerate(year_):
        day = list(filter(lambda x: x[3] != 0, month))[2][3]
        mondays.append(date(year, m_idx + 1, day))
    return [date.strftime(dt, '%d.%m.%Y') for dt in mondays]


print(*get_free_days(int(input())), sep='\n')
```