# 4.1 Введение

Задача на программирование: различные слагаемые По данному числу 1≤n≤10^9 найдите максимальное число k, для которого n
можно представить как сумму k различных натуральных слагаемых. Выведите в первой строке число k, во второй — k
слагаемых.

**Sample Input 1:**

```
4
```

**Sample Output 1:**

```
2
1 3 
```

**Sample Input 2:**

```
6
```

**Sample Output 2:**

```
3
1 2 3 
```

# Solution

```python
n, check, cnt, i = int(input()), [], 1, 0
while (1 + i) / 2 * (i) < n - 2 * (i + 1):
    i += 1
print(i + 1)
x = range(1, i + 1)
print(*x, n - sum(x) if n - sum(x) != 0 else "")
```