# 8.4 Рюкзак

# Задача на программирование: рюкзак

Первая строка входа содержит целые числа 1≤W≤10000 и 1≤n≤300 — вместимость рюкзака и число золотых слитков. Следующая
строка содержит nn целых чисел 0≤w1,…,wn≤100000, задающих веса слитков. Найдите максимальный вес золота, который можно
унести в рюкзаке.

**Sample Input:**

```
10 3
1 4 8
```

**Sample Output:**

```
9
```

# Solution

```python
W, n = [int(x) for x in input().split()]
w = [int(x) for x in input().split()]
ans = [[0] * n for _ in range(W + 1)]
for i in range(n):
    for j in range(W + 1):
        if j >= w[i]:
            ans[j][i] = max(ans[j][i - 1], ans[j - w[i]][i - 1] + w[i])
        else:
            ans[j][i] = ans[j][i - 1]
print(ans[W][n - 1])
```