# 8.7 Обзор

# Задача на программирование: калькулятор

У вас есть примитивный калькулятор, который умеет выполнять всего три операции с текущим числом x: заменить x на 2x, 3x
или x+1. По данному целому числу 1≤n≤100000 определите минимальное число операций k, необходимое, чтобы получить n из 1.
Выведите k и последовательность промежуточных чисел.

**Sample Input 1:**

```
1
```

**Sample Output 1:**

```
0
1 
```

**Sample Input 2:**

```
5
```

**Sample Output 2:**

```
3
1 2 4 5 
```

**Sample Input 3:**

```
96234
```

**Sample Output 3:**

```
14
1 3 9 10 11 22 66 198 594 1782 5346 16038 16039 32078 96234 
```

# Solution

```python
n = int(input())
a = [i for i in range(n + 1)]
a[1] = 0

for i in range(2, n + 1):
    minn = a[i - 1] + 1
    if i % 2 == 0:
        minn = min(minn, a[i // 2] + 1)
    if i % 3 == 0:
        minn = min(minn, a[i // 3] + 1)

    a[i] = minn

ret = []
i = n
while i > 1:
    if a[i] == a[i - 1] + 1:
        ret.append(1)
        i -= 1
        continue

    if i % 2 == 0 and a[i] == a[i // 2] + 1:
        ret.append(2)
        i //= 2
        continue

    ret.append(3)
    i //= 3

print(a[n])
ret = ret[::-1]


def result(arr):
    x = 1
    res = [x]
    for i in range(len(arr)):
        if arr[i] == 1:
            x += 1
        if arr[i] == 2:
            x *= 2
        if arr[i] == 3:
            x *= 3
        res.append(x)
    return res


print(*result(ret))

```