# 4.3 Вложенные списки. Часть 2
# Разбиение на чанки 🌶️
На вход программе подаются две строки, на одной символы, на другой число n. Из первой строки формируется список.

Реализуйте функцию chunked(), которая принимает на вход список и число, задающее размер чанка (куска), а возвращает список из чанков указанной длины.

**Формат входных данных**

На вход программе подается строка текста, содержащая символы, отделенные символом пробела и число nn на отдельной строке.

**Формат выходных данных**

Программа должна вывести указанный вложенный список.

Примечание. Не забудьте вызвать функцию chunked(), чтобы вывести результат 😀.

**Sample Input 1:**
```
a b c d e f
2
```
**Sample Output 1:**
```
[['a', 'b'], ['c', 'd'], ['e', 'f']]
```
**Sample Input 2:**
```
a b c d e f
3
```
**Sample Output 2:**
```
[['a', 'b', 'c'], ['d', 'e', 'f']]
```
**Sample Input 3:**
```
a b c d e f
6
```
**Sample Output 3:**
```
[['a', 'b', 'c', 'd', 'e', 'f']]
```
**Sample Input 4:**
```
a b c d e f r g b
2
```
**Sample Output 4**:
```
[['a', 'b'], ['c', 'd'], ['e', 'f'], ['r', 'g'], ['b']]
```
**Sample Input 5:**
```
a b
3
```
**Sample Output 5:**
```
[['a', 'b']]
```
# Solution
```python
s, n = input().split(), int(input())
last_list = []
if len(s) % n != 0:
    last = len(s) % n
    for i in range(1, last + 1):
        last_list.append(s[i - last - 1])


def group(iterable, count):
    return zip(*[iter(iterable)] * count)


a = list(group(s, n))
x = []
for i in a:
    x.append(list(i))
if len(s) % n != 0:
    x.append(last_list)
print(x)
```