# 4.7 Операции над матрицами в математике
# Возведение матрицы в степень 🌶️
Напишите программу, которая возводит квадратную матрицу в mm-ую степень.

**Формат входных данных**

На вход программе подаётся натуральное число nn — количество строк и столбцов в матрице, затем элементы матрицы, затем натуральное число mm.

**Формат выходных данных**

Программа должна вывести результирующую матрицу, разделяя элементы символом пробела.

**Sample Input 1:**
```
3
1 2 3
4 5 6
7 8 9
2
```
**Sample Output 1:**
```
30 36 42
66 81 96
102 126 150
```
**Sample Input 2:**
```
3
1 2 1
3 3 3
1 2 1
5
```
**Sample Output 2:**
```
1666 2222 1666
3333 4443 3333
1666 2222 1666
```
**Sample Input 3:**
```
5
1 2 1 1 2
3 3 3 3 3
1 2 1 1 2
3 3 3 3 3
1 2 1 1 2
3
```
**Sample Output 3:**
```
133 176 133 133 176
279 369 279 279 369
133 176 133 133 176
279 369 279 279 369
133 176 133 133 176
```
# Solution
```python
n = int(input())
matrix = [list(map(int, input().split())) for i in range(n)]
matrix2 = matrix.copy()
for i in range(int(input()) - 1):
    matrix = [[sum(e1 * e2 for e1, e2 in zip(row, column))
               for column in zip(*matrix)] for row in matrix2]

for i in matrix:
    for j in i:
        print(j, end=" ")
    print()

```