# 2.4 Настройка ожиданий

# Задание: ждем нужный текст на странице

Попробуем теперь написать программу, которая будет бронировать нам дом для отдыха по строго заданной цене. Более высокая
цена нас не устраивает, а по более низкой цене объект успеет забронировать кто-то другой.

В этой задаче вам нужно написать программу, которая будет выполнять следующий сценарий:

* Открыть страницу http://suninjuly.github.io/explicit_wait2.html
* Дождаться, когда цена дома уменьшится до $100 (ожидание нужно установить не меньше 12 секунд)
* Нажать на кнопку "Book"
* Решить уже известную нам математическую задачу (используйте ранее написанный код) и отправить решение

Чтобы определить момент, когда цена аренды уменьшится до $100, используйте метод **text_to_be_present_in_element** из
библиотеки expected_conditions.

Если все сделано правильно и быстро, то вы увидите окно с числом. Отправьте его в качестве ответа на это задание.

# Solution

```python
import time
from selenium.webdriver.common.by import By
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC
from selenium import webdriver

def calc(x):
    import math
    return str(math.log(abs(12 * math.sin(int(x)))))

try:
    browser = webdriver.Chrome()
    browser.get("http://suninjuly.github.io/explicit_wait2.html")

    button = browser.find_element(By.ID, 'book')
    textt = WebDriverWait(browser, 12).until(
        EC.text_to_be_present_in_element((By.ID, "price"), '$100')
    )
    button.click()
    num = browser.find_element(By.ID, "input_value").text
    input_area = browser.find_element(By.ID, "answer").send_keys(calc(num))
    submit_button = browser.find_element(By.ID, "solve").click()
    print(browser.switch_to.alert.text.split()[-1])
finally:
    #если что-то пошло не так можно отменить отправку
    time.sleep(5)
    browser.quit()
```