# 3.8 Spiral matrix

Выведите таблицу размером n×n, заполненную целыми числами от 11 до n^2
по спирали, выходящей из левого верхнего угла и закрученной по часовой стрелке, как показано в примере.

**Формат ввода:**

Одна строка, содержащая одно целое число n, n > 0.

**Формат вывода:**

Таблица из n строк, значения в строках разделены пробелом.

**Sample Input:**

```
5
```

**Sample Output:**

```
1 2 3 4 5
16 17 18 19 6
15 24 25 20 7
14 23 22 21 8
13 12 11 10 9
```

# Solution

```python
n = m = int(input())

a = [[0] * m for _ in range(n)]

i, j, d = 0, 0, 0
moves = ((0, 1,), (1, 0,), (0, -1,), (-1, 0,),)
for k in range(1, n * m + 1):
    a[i][j] = k
    for l in range(4):
        newD = (d + l) % 4
        di, dj = moves[newD]
        newI, newJ = i + di, j + dj
        if 0 <= newI < n and 0 <= newJ < m and a[newI][newJ] == 0:
            i, j, d = newI, newJ, newD
            break
for row in a:
    print(*row)
```
