# 5.2 Old LCD calculator

Напишите программу, которая выводит число в стиле LCD калькулятора.

На вход программе подаётся последовательность цифр, которую нужно вывести на экран в специальном стиле (см. пример).

Размер всех цифр 4 символа в ширину и 7 символов в высоту. Между цифрами в выводе должен быть один пустой столбец. Перед
первой цифрой не должно быть пробелов.

Выведенные цифры должны быть обведены рамочкой, в углах которой находится символ x ("икс"), горизонтальная линия
создаётся из символа - ("дефис"), а вертикальная -- из символа вертикальной черты: |.

**Формат ввода:**

Строка произвольной длины (минимум один символ), содержащая последовательность цифр.

**Формат вывода:**

9 строк, содержащих цифры, записанные в указанном в задании формате.

**Sample Input:**

`0123456789`

**Sample Output:**

```
x-------------------------------------------------x
| --        --   --        --   --   --   --   -- |
||  |    |    |    | |  | |    |       | |  | |  ||
||  |    |    |    | |  | |    |       | |  | |  ||
|           --   --   --   --   --        --   -- |
||  |    | |       |    |    | |  |    | |  |    ||
||  |    | |       |    |    | |  |    | |  |    ||
| --        --   --        --   --        --   -- |
x-------------------------------------------------x
```

# Решение/Solution

```
d = {'0': (' -- ', '|  |', '|  |', '    ', '|  |', '|  |', ' -- '),
     '1': ('    ', '   |', '   |', '    ', '   |', '   |', '    '),
     '2': (' -- ', '   |', '   |', ' -- ', '|   ', '|   ', ' -- '),
     '3': (' -- ', '   |', '   |', ' -- ', '   |', '   |', ' -- '),
     '4': ('    ', '|  |', '|  |', ' -- ', '   |', '   |', '    '),
     '5': (' -- ', '|   ', '|   ', ' -- ', '   |', '   |', ' -- '),
     '6': (' -- ', '|   ', '|   ', ' -- ', '|  |', '|  |', ' -- '),
     '7': (' -- ', '   |', '   |', '    ', '   |', '   |', '    '),
     '8': (' -- ', '|  |', '|  |', ' -- ', '|  |', '|  |', ' -- '),
     '9': (' -- ', '|  |', '|  |', ' -- ', '   |', '   |', ' -- ')
     }
digits = [d['0'], d['1'], d['2'], d['3'], d['4'], d['5'], d['6'], d['7'], d['8'], d['9']]
conv = {"ugol": "x", "l": "-", "stolb": "|", "space": ' '}

s = input()
length = conv["l"] * (len(s) * 4 + (len(s)))
line = ''
print(conv["ugol"] + length + conv["ugol"])
for j in range(0, 7):
    line = conv["stolb"]
    for i in s:
        line += str(digits[int(i)][j]) + conv["space"]
    line += conv["stolb"]
    print(line)
print(conv["ugol"] + length + conv["ugol"])
```